#!/usr/bin/python
# -*- coding: UTF-8 -*-
'''  
韵脚er1共收录汉字1个  
韵脚ve3共收录汉字3个  
韵脚vn3共收录汉字4个  
韵脚er4共收录汉字5个  
韵脚er2共收录汉字7个  
韵脚ie3共收录汉字8个  
韵脚ve1共收录汉字9个  
韵脚er3共收录汉字10个  
韵脚ve2共收录汉字12个  
韵脚vn1共收录汉字13个  
韵脚iu3共收录汉字14个  
韵脚vn2共收录汉字17个  
韵脚iu2共收录汉字19个  
韵脚iu4共收录汉字21个  
韵脚un3共收录汉字21个  
韵脚ve4共收录汉字24个  
韵脚eng3共收录汉字25个  
韵脚in3共收录汉字25个  
韵脚iu1共收录汉字25个  
韵脚un4共收录汉字26个  
韵脚vn4共收录汉字26个  
韵脚ie1共收录汉字27个  
韵脚ui3共收录汉字29个  
韵脚un2共收录汉字29个  
韵脚in4共收录汉字30个  
韵脚ing3共收录汉字30个  
韵脚ai2共收录汉字31个  
韵脚in2共收录汉字33个  
韵脚ei3共收录汉字35个  
韵脚v1共收录汉字35个  
韵脚ui2共收录汉字37个  
韵脚a3共收录汉字38个  
韵脚v3共收录汉字39个  
韵脚ai1共收录汉字40个  
韵脚o3共收录汉字41个  
韵脚ei2共收录汉字42个  
韵脚en3共收录汉字42个  
韵脚v2共收录汉字42个  
韵脚ong4共收录汉字43个  
韵脚eng4共收录汉字44个  
韵脚ei1共收录汉字46个  
韵脚ai3共收录汉字47个  
韵脚in1共收录汉字47个  
韵脚ong3共收录汉字47个  
韵脚ing4共收录汉字49个  
韵脚e3共收录汉字52个  
韵脚e1共收录汉字53个  
韵脚en2共收录汉字54个  
韵脚ie2共收录汉字54个  
韵脚ou3共收录汉字55个  
韵脚un1共收录汉字56个  
韵脚ie4共收录汉字57个  
韵脚ou1共收录汉字57个  
韵脚ou2共收录汉字57个  
韵脚ui1共收录汉字59个  
韵脚en1共收录汉字62个  
韵脚ei4共收录汉字63个  
韵脚v4共收录汉字63个  
韵脚en4共收录汉字65个  
韵脚ing1共收录汉字65个  
韵脚e2共收录汉字66个  
韵脚eng2共收录汉字73个  
韵脚ing2共收录汉字75个  
韵脚o1共收录汉字76个  
韵脚ong2共收录汉字76个  
韵脚ang3共收录汉字85个  
韵脚ou4共收录汉字85个  
韵脚ui4共收录汉字87个  
韵脚a2共收录汉字89个  
韵脚o2共收录汉字96个  
韵脚eng1共收录汉字98个  
韵脚ong1共收录汉字98个  
韵脚ai4共收录汉字99个  
韵脚e4共收录汉字100个  
韵脚o4共收录汉字103个  
韵脚a4共收录汉字105个  
韵脚ao3共收录汉字107个  
韵脚u3共收录汉字113个  
韵脚u1共收录汉字115个  
韵脚a1共收录汉字119个  
韵脚ao2共收录汉字119个  
韵脚ang4共收录汉字121个  
韵脚ang2共收录汉字124个  
韵脚i3共收录汉字135个  
韵脚ao1共收录汉字143个  
韵脚u2共收录汉字145个  
韵脚ang1共收录汉字148个  
韵脚i2共收录汉字163个  
韵脚ao4共收录汉字170个  
韵脚an3共收录汉字182个  
韵脚i1共收录汉字191个  
韵脚u4共收录汉字213个  
韵脚an2共收录汉字220个  
韵脚an1共收录汉字231个  
韵脚an4共收录汉字311个  
韵脚i4共收录汉字322个  
此次共收录汉字6913个  
'''
  
###  
# @usage   汉字韵脚库  
# @author  mw  
# @date    2016年10月25日  星期二  10:11:57   
# @param  
# @return  
#  
###  
#汉字韵脚  
  
'''
a1 = [阿, 啊, 八, 巴, 叭, 吧, 芭, 疤, 粑, 蚆, 笆, 捌, 羓, 豝, 鲃,擦, 攃, 嚓, 叉, 扱, 扠, 杈, 差, 插, 嗏, 艖, 欻, 哒, 耷, 搭, 褡, 发, 彂, 酦, 旮, 伽, 嘎, 瓜, 刮, 呱, 胍, 栝, 鸹, 踻, 哈, 紦, 铪, 花, 哗, 砉, 加, 夹, 伽, 佳, 迦, 珈, 枷, 家, 痂, 笳, 袈, 葭, 跏, 嘉, 咖, 咔, 喀, 夸, 拉,垃, 啦, 喇, 邋, 妈, 叭, 趴, 啪, 葩, 掐, 撒, 仨, 杀, 沙, 纱,砂, 莎, 铩, 痧, 裟, 鲨, 刷, 唰, 它, 她, 塌, 凹, 洼, 挖, 娲, 蛙,  虾, 瞎, 压, 呀, 押, 鸦, 鸭, 桠, 匝, 咂, 扎, 吒, 查, 渣, 喳, 猹, 楂, 齄, 抓]; 
a2 = [茇, 妭, 拔, 炦, 胈, 癹, 菝, 跋, 颰, 鬾, 鼥,茬, 茶, 查, 猹, 搽, 靫, 察, 檫, 达, 怛, 妲, 沓, 答, 跶, 靼, 鞑, 乏, 伐, 姂, 坺, 垡, 阀, 罚, 筏, 噶, 尜, 蛤, 划, 华, 呚, 哗, 骅, 姡, 猾, 滑, 搳, 磆, 螖, 荚, 颊, 旯, 磖, 麻, 蟆, 拏, 拿, 扒, 杷, 爬, 耙, 琶, 啥, 娃, 匣, 狎, 侠, 狭, 峡, 遐, 瑕, 暇, 辖, 霞, 黠, 牙, 伢, 芽, 岈, 琊, 崖, 涯, 衙, 杂, 砸, 轧, 札, 闸, 铡]; 
a3 = [把, 钯, 靶, 礤, 衩, 打, 嗲, 法, 峜, 砝, 佱, 玍, 尕, 剐, 寡, 奤,  贾, 假, 卡, 垮, 喇, 马, 犸, 玛, 码, 蚂, 哪, 洒, 撒, 傻, 耍, 塔, 獭, 瓦, 佤, 哑, 雅, 咋]; 
a4 = [坝, 爸, 杷, 罢, 耙, 跁, 鲅, 靶, 罷, 霸, 壩, 灞, 欛, 遪, 奼, 汊, 杈, 岔, 刹, 侘, 诧, 姹, 差, 大, 亣, 汏, 眔, 发, 珐, 髪, 尬, 魀, 卦, 诖, 坬, 挂, 掛, 罣, 褂, 化, 夻, 话, 桦, 画, 婳, 舙, 价, 驾, 架, 嫁, 稼, 挎, 胯, 跨, 腊, 蜡, 辣, 瘌, 蝲, 骂, 蚂, 那, 呐, 纳, 娜, 钠, 衲, 捺, 帕, 怕, 恰, 洽, 髂, 飒, 萨, 厦, 煞, 歃, 霎, 拓, 沓, 挞, 送, 榻, 踏, 蹋, 袜, 下, 吓, 夏, 厦, 罅, 轧, 亚, 讶, 迓, 揠, 乍, 诈, 咤, 炸, 栅, 昨, 槎, 榨]; 
 
o1 = [癷, 波, 拨, 玻, 饽, 钵, 盋, 砵, 剥, 趵, 菠, 啵, 溊, 蕃, 播, 嶓, 礴, 逴, 踔, 戳, 搓, 瑳, 磋, 撮, 醝, 蹉, 多, 夛, 咄, 哆, 剟, 裰, 呙, 咶, 埚, 郭, 猓, 崞, 锅, 聒, 墎, 蝈, 彉, 劐, 豁, 捋, 啰, 摸, 泊, 泼, 坡, 颇, 说, 唆, 娑, 梭, 蓑, 羧, 缩, 托, 拖, 脱, 挝, 涡, 倭, 莴, 窝, 蜗, 拙, 捉, 倬, 桌, 涿, 擢, 作, 嘬]; 
o2 = [仢, 伯, 驳, 孛, 泊, 狛, 帛, 勃, 柏, 钹, 亳, 萡, 脖, 舶, 渤, 鹁, 博, 猼, 愽, 搏, 铂, 箔, 膊, 踣, 薄, 襮, 礴, 嵳, 睉, 蒫, 矬, 瘥, 酂, 鹾, 夺, 度, 铎, 痥, 踱, 敚, 佛, 仏, 国, 帼, 腘, 聝, 虢, 馘, 活, 罗, 萝, 逻, 锣, 骡, 箩, 螺, 谟, 馍, 淼, 模, 摹, 膜, 麽, 摩, 磨, 嬷, 魔, 娜, 傩, 婆, 鄱, 皤, 驮, 陀, 驼, 沱, 坨, 鸵, 砣, 酡, 橐, 鼍, 灼, 卓, 茁, 浊, 斫, 浞, 酌, 啄, 琢, 濯, 镯, 昨, 笮, 琢]; 
o3 = [跛, 簸, 脞, 朵, 朶, 杕, 饳, 剁, 沲, 哚, 挆, 柮, 垛, 缍, 躲,  果, 菒, 馃, 惈, 粿, 裹, 火, 伙, 夥, 裸, 蠃, 抹, 懡, 叵, 笸,  所, 唢, 索, 琐, 锁, 妥, 椭, 我, 左,  佐, 撮]; 
o4 = [孹, 檗, 擘, 簸, 蘗, 辵, 哾, 娖, 娕, 婼, 婥, 嗓, 涰, 绰, 惙, 辍, 酫, 踀, 龊, 擉, 剉, 剒, 莝, 莡, 厝, 挫, 措, 逪, 锉, 错, 堕, 堕, 憜, 鵽, 刴, 挅, 过, 腂, 货, 获, 祸, 惑, 霍, 豁, 蠖, 镬, 扩, 括, 阔, 廓, 洛, 骆, 络, 烙, 落, 漯, 末, 没, 陌, 殁, 莫, 秣, 貊, 蓦, 默, 诺, 喏, 搦, 糑, 懦, 糯, 迫, 破, 粕, 魄, 若, 偌, 弱, 箬, 烁, 朔, 铄, 硕, 搠, 槊, 拓, 柝, 唾, 箨, 魄, 沃, 卧, 幄, 渥, 握, 斡, 龌, 坐, 作, 祚, 座, 做, 唑]; 
 
e1 = [车, 嘚, 妸, 妿,婀, 屙, 戈, 仡, 犵, 扢, 纥, 戓, 肐, 疙, 咯, 饷, 哥, 胳, 鸽, 搁, 割, 歌, 戨, 诃, 呵, 抲, 喝, 蠚, 欱, 苛, 坷, 珂, 科, 轲, 柯, 疴, 棵, 稞, 窠, 瞌, 蝌, 磕, 颗, 了, 奢, 赊,  耶, 掖, 椰, 噎, 蜇, 遮, 螫]; 
e2 = [恴, 得, 淂, 棏, 悳, 德, 讹, 囮, 俄, 峉, 峨, 涐, 恶, 娥, 莪, 珴, 皒, 鹅, 蛾, 额, 呄, 佮, 茖, 阁, 挌, 革, 鬲, 格, 敋, 隔, 祴, 蛤, 蛒, 愅, 嗝, 滆, 搿, 骼, 镉, 壳, 咳, 舌, 佘, 蛇, 揲, 爷, 揶, 则, 泽, 责, 迮, 择, 帻, 啧, 舴, 笮, 箐, 赜, 折, 哲, 辄, 蛰, 谪, 摺, 磔, 辙]; 
e3 = [扯, 偖, 撦, 苊,  舸, 葛, 嗰, 禾, 纥, 合, 何, 和, 咊, 郃, 姀, 河, 盇, 狢, 峆, 饸, 阂, 籺, 荷, 核, 盍, 盉, 涸, 盒, 菏, 萂, 龁, 颌, 惒, 鲄, 貈, 鹖, 翮, 篕, 皬, 可, 坷, 渴, 喏, 惹, 舍, 也, 冶, 野, 者, 褚, 赭, 褶]; 
e4 = [夨, 册, 冊, 侧, 厕, 测, 恻, 笧, 萗, 策, 憡, 簎, 屮, 彻, 迠, 坼, 烢, 聅, 硩, 掣, 撤, 澈, 徹, 瞮, 勶, 颚, 饿, 愕, 鹗, 噩, 恶, 垩, 鳄, 个, 各, 虼, 個, 铬, 硌, 箇, 贺, 褐, 赫, 鹤, 翯, 壑, 嚇, 鶮, 克, 刻, 客, 恪, 课, 溘, 乐, 勒, 讷, 热, 色, 涩, 啬, 铯, 瑟, 塞, 穑, 设, 社, 舍, 涉, 射, 赦, 慑, 摄, 歙, 忑, 忒, 特, 慝,业, 叶, 页, 邺, 夜, 曳, 拽, 咽, 烨, 晔, 掖, 液, 谒, 腋, 仄, 昃, 侧, 这, 柘, 浙, 蔗, 鹧]; 
 
i1 = [屄, 皀, 逼, 毴, 楅, 豍, 螕, 鲾, 吃, 妛, 彨, 哧, 胵, 鸱, 蚩, 粚, 笞, 眵, 瓻, 喫, 嗤, 媸, 摛, 痴, 瞝, 魑, 癡, 攡, 呲, 玼, 疵, 偨, 髊, 氐, 仾, 低, 岻, 秖, 羝, 堤, 滴, 嘀, 镝, 鞮, 堆, 痽, 磓, 鐜, 几, 讥, 击, 饥, 圾, 机, 乩, 肌, 玑, 鸡, 矶, 姬, 屐, 积, 笄, 基, 嵇, 赍, 犄, 缉, 畸, 跻, 箕, 稽, 畿, 齑, 激, 羁, 哩, 咪, 眯, 妮, 丕, 批, 纰, 邳, 披, 砒, 劈, 七, 沏, 妻, 栖, 凄, 萋, 戚, 欺, 期, 漆, 蹊, 尸, 失, 师, 诗, 虱, 狮, 施, 湿, 丝, 司, 私, 咝, 思, 斯, 厮, 嘶, 撕, 剔, 踢, 梯, 夕, 兮, 吸, 汐, 西, 希, 析, 昔, 奚, 唏, 栖, 牺, 息, 悉, 硒, 欷, 惜, 烯, 淅, 溪, 犀, 晰, 皙, 翕, 稀, 锡, 熙, 僖, 熄, 晰, 膝, 嘻, 嬉, 熹, 螅, 羲, 蟋, 一, 伊, 衣, 医, 依, 咿, 铱, 揖, 漪, 之, 支, 只, 汁, 芝, 吱, 知, 肢, 织, 枝, 栀, 卮, 祗, 脂, 蜘, 孜, 吱, 甾, 兹, 姿, 咨, 资, 兹, 淄, 滋, 锱, 髭]; 
i2 = [荸, 鼻, 弛, 驰, 池, 迟, 迡, 茌, 坻, 荎, 持, 匙, 筂, 墀, 漦, 遲, 踟, 词, 茈, 茨, 祠, 瓷, 辞, 慈, 鹚, 磁, 雌, 飺, 糍, 辤, 狄, 迪, 籴, 荻, 涤, 敌, 啇, 笛, 靮, 觌, 滌, 翟, 嫡, 蔋, 鸐, 及, 伋, 吉, 汲, 级, 极, 即, 亟, 急, 笈, 疾, 殛, 棘, 楫, 辑, 蒺, 嫉, 瘠, 厘, 骊, 猂, 离, 梨, 犁, 鹂, 蜊, 漓, 篱, 璃, 鲡, 罹, 棃, 漓, 弥, 祢, 迷, 谜, 醚, 糜, 麋, 蘼, 尼, 铌, 倪, 猊, 霓, 鲵, 泥, 皮, 枇, 毗, 疲, 啤, 琵, 脾, 罴, 貔, 羆, 祁, 齐, 岐, 奇, 其, 祈, 祇, 歧, 脐, 颀, 畦, 骑, 骐, 棋, 琦, 琪, 旗, 十, 石, 什, 时, 实, 食, 蚀, 埘, 提, 啼, 题, 鹈, 醍, 蹄, 习, 席, 袭, 媳, 隰, 檄, 仪, 夷, 诒, 宜, 怡, 姨, 贻, 咦, 胰, 移, 遗, 颐, 疑, 彝, 嶷, 执, 侄, 直, 值, 职, 殖, 植, 跖]; 
i3 = [匕, 比, 朼, 夶, 吡, 妣, 沘, 佊, 疕, 彼, 毞, 柀, 秕, 笔, 粃, 舭, 俾, 啚, 鄙, 箄, 聛, 貏, 尺, 叺, 伬, 齿, 侈, 垑, 胣, 蚇, 耻, 恥, 豉, 袳, 欼, 裭, 此, 佌, 泚, 皉, 跐, 邸, 诋, 底, 抵, 砥, 聜, 鯳, 頧, 几, 己, 济, 挤, 脊, 戟, 礼, 李, 里, 俚, 理, 逦, 鲤, 米, 芈, 靡, 拟, 你, 逆, 昵, 匿, 腻, 愵, 溺, 嶷, 匹, 吡, 否, 痞, 癖, 乞, 企, 岂, 杞, 启, 起, 绮, 綮, 史, 矢, 豕, 使, 驶, 始, 屎, 死, 体, 洗, 玺, 徙, 喜, 屣, 乙, 己, 以, 钇, 矣, 苡, 蚁, 倚, 椅, 旖, 止, 只, 旨, 芷, 纸, 址, 祉, 枳, 咫, 指, 趾, 酯, 徵, 子, 仔, 姊, 籽, 耔, 秭, 茈, 梓, 紫, 訾, 滓]; 
i4 = [币, 必, 毕, 闭, 庇, 佖, 诐, 芘, 邲, 坒, 怭, 怶, 苾, 妼, 泌, 陛, 毖 柲, 珌, 毙, 狴, 婢, 敝, 愎, 弼, 裨, 辟, 蓖, 痹, 碧, 蔽, 弊, 箅, 壁, 避, 篦, 髀, 臂, 璧, 叱, 斥, 杘, 饬, 灻, 抶, 侙, 勅, 恜, 炽, 翅, 敕, 烾, 湁, 啻, 雴, 傺, 腟, 痸, 翤, 瘈, 遫, 憏, 瘛, 熾, 趩, 次, 伺, 佽, 刺, 刾, 疵, 茦, 栨, 赐, 蛓, 螆, 地, 坔, 杕, 旳, 弟, 的, 埅, 帝, 娣, 俤, 递, 埊, 焍, 谛, 菂, 第, 揥, 棣, 缔, 楴, 腣, 队, 对, 兊, 兑, 怼, 计, 记, 伎, 纪, 系, 忌, 际, 妓, 技, 剂, 季, 迹, 既, 荠, 济, 洎, 觊, 继, 绩, 悸, 祭, 偈, 寄, 寂, 蓟, 禝, 暨, 霁, 鲫, 稷, 冀, 髻, 骥, 力, 历, 厉, 立, 吏, 丽, 利, 吏, 沥, 枥, 例, 戾, 励, 隶, 俐, 荔, 郦, 栎, 猁, 栗, 莉, 莅, 砾, 砺, 粒, 笠, 唳, 痢, 溧, 汩, 泌, 宓, 觅, 秘, 密, 幂, 蜜, 屁, 辟, 睥, 僻, 璧, 气, 讫, 汽, 弃, 泣, 契, 砌, 器, 憩, 日, 士, 氏, 示, 市, 世, 仕, 似, 式, 事, 侍, 势, 试, 饰, 视, 柿, 是, 恃, 峙, 拭, 室, 适, 逝, 舐, 轼, 释, 弑, 谥, 巳, 四, 似, 寺, 汜, 姒, 兕, 祀, 驷, 饲, 泗, 俟, 耜, 肆, 嗣, 屉, 剃, 倜, 涕, 悌, 惕, 替, 嚏, 戏, 系, 细, 郄, 阋, 隙, 禊, 义, 亿, 弋, 刈, 艺, 忆, 议, 役, 异, 亦, 屹, 抑, 呓, 佚, 译, 邑, 易, 诣, 佾, 驿, 怿, 绎, 弈, 奕, 疫, 羿, 轶, 益, 谊, 挹, 悒, 逸, 翊, 翌, 溢, 缢, 意, 肄, 裔, 毅, 镒, 熠, 殪, 薏, 劓, 噫, 翳, 甏, 至, 豸, 志, 炙, 质, 治, 织, 制, 帜, 帙, 峙, 挚, 秩, 贽, 致, 窒, 痔, 鸷, 掷, 智, 痣, 彘, 置, 雉, 稚, 滞, 字, 自, 恣, 眦, 渍]; 
 
u1 = [逋, 峬, 晡, 出, 初, 摴, 樗, 貙, 怚, 粗, 麄, 厾, 剢, 都, 阇, 督, 嗜, 夫, 伕, 呋, 肤, 柎, 荂, 麸, 趺, 跗, 稃, 鄜, 孵, 敷, 糐, 估, 杚, 姑, 沽, 泒, 孤, 苽, 咕, 呱, 轱, 鸪, 罛, 唂, 菰, 菇, 蛄, 笟, 辜, 酤, 毂, 箍, 乎, 匢, 芴, 呼, 忽, 昒, 恗, 惚, 唿, 滹, 刳, 枯, 哭, 窟, 撸, 噜, 模, 仆, 扑, 铺, 书, 殳, 抒, 纾, 叔, 枢, 姝, 倏, 殊, 梳, 菽, 淑, 疏, 舒, 输, 蔬, 苏, 酥, 凸, 秃, 突, 乌, 邬, 污, 呜, 巫, 屋, 诬, 钨, 朱, 邾, 侏, 诛, 茱, 诸, 珠, 株, 猪, 铢, 蛛, 租, 苴, 菹]; 
u2 = [刍, 除, 芻, 厨, 蒢, 豠, 滁, 锄, 雏, 趎, 蒭, 蜍, 搊, 篨, 橱, 躇, 蹰, 徂, 殂, 独, 毒, 读, 渎, 牍, 椟, 裻, 黩, 巿, 弗, 凫, 伏, 甶, 孚, 芾, 芙, 扶, 拂, 绂, 绋, 苻, 帗, 服, 氟, 枹, 罘, 畉, 茯, 俘, 浮, 蚨, 袱, 虙, 艴, 符, 涪, 幅, 跗, 艀, 福, 蜉, 豧, 蝠, 鹘, 抇, 囫, 狐, 弧, 胡, 瓳, 壶, 隺, 斛, 焀, 鹄, 猢, 搰, 湖, 喖, 葫, 媩, 糊, 瑚, 鹘, 鹕, 蝴, 箶, 槲, 糊, 醐, 卢, 芦, 庐, 泸, 炉, 鸬, 颅, 母, 牡, 姆, 亩, 胟, 奴, 驽, 孥, 仆, 匍, 莆, 菩, 脯, 蔳, 璞, 濮, 如, 茹, 儒, 濡, 孺, 褚, 蠕, 孰, 赎, 塾, 俗, 图, 涂, 徒, 荼, 途, 涂, 屠, 无, 芜, 吾, 吴, 梧, 蜈, 竹, 竺, 烛, 逐, 躅, 足, 卒, 族, 镞]; 
u3 = [卜, 卟, 补, 哺, 捕, 補, 杵, 础, 處, 椘, 榰, 储, 禇, 楚, 褚, 濋, 檚, 礎,笃, 堵, 赌, 睹, 覩, 甫, 抚, 拊, 府, 斧, 俛, 俯, 捬, 脯, 辅, 腑, 焤, 蜅, 腐, 頫, 黼, 夃, 古, 诂, 汩, 谷, 股, 牯, 骨, 羖, 贾, 罟, 蛄, 蛊, 鼓, 嘏, 榖, 瞽, 濲, 蠱, 虎, 浒, 汻, 俿, 唬, 琥, 苦, 卤, 虏, 掳, 鲁, 橹, 努, 弩, 朴, 浦, 圊, 普, 溥, 谱, 汝, 乳, 辱, 属, 黍, 鼠, 蜀, 数, 署, 薯, 曙, 土, 吐, 钍, 五, 午, 仵, 妩, 庑, 忤, 武, 侮, 捂, 鹉, 舞, 主, 拄, 渚, 煮, 嘱, 瞩, 阻, 组, 俎, 祖] ; 
u4 = [不, 布, 呸, 步, 怖, 钚, 部, 埔, 埠, 瓿, 蔀, 踄, 篰, 簿, 亍, 処, 处, 竌, 豖, 绌, 怵, 泏, 竐, 欪, 畜, 俶, 敊, 埱, 珿, 滀, 搐, 触, 閦, 黜, 斶, 觸, 矗, 促, 猝, 酢, 蔟, 趗, 醋, 憱, 踧, 噈, 瘯, 踿, 簇, 蹙, 蹴, 顣, 芏, 杜, 妒, 肚, 妬, 度, 荰, 秺, 靯, 渡, 镀, 螙, 蠧, 蟗, 讣, 父, 付, 妇, 负, 附, 咐, 驸, 坿, 竎, 阜, 赴, 复, 副, 富, 赋, 腹, 缚, 蝮, 馥, 覆, 固, 故, 顾, 凅, 牯, 梏, 崮, 崓, 雇, 锢, 鲴, 互, 弖, 户, 芐, 护, 沪, 帍, 戽, 岵, 怙, 枑, 祜, 怘, 笏, 瓠, 扈, 婟, 邿, 嫮, 滬, 鳠, 库, 绔, 裤, 喾, 酷, 陆, 录, 赂, 略, 逯, 鹿, 禄, 剹, 碌, 路, 箓, 戮, 辘, 潞, 鹭, 露, 木, 目, 沐, 苜, 牧, 募, 幕, 墓, 睦, 慕, 暮, 穆, 怒, 铺, 瀑, 曝, 入, 溽, 缛, 术, 戍, 束, 述, 树, 竖, 恕, 庶, 数, 墅, 漱, 夙, 诉, 肃, 速, 素, 宿, 谡, 粟, 愫, 塑, 嗉, 溯, 簌, 吐, 兔, 菟, 兀, 勿, 务, 戊, 芴, 物, 误, 恶, 悟, 晤, 骛, 雾, 寤, 伫, 助, 贮, 驻, 杼, 注, 祝, 柱, 炷, 蛀, 著, 铸, 箸, 筑]; 
 
v1 = [且, 拘, 狙, 驹, 居, 掬, 据, 琚, 裾, 雎, 躹, 区, 曲, 驱, 岖, 屈, 祛, 躯, 趋, 蛐, 吁, 圩, 盱, 胥, 须, 戌, 虚, 需, 墟, 嘘,  迂, 吁, 纡, 瘀, 淤]; 
v2 = [局, 桔, 菊, 焗, 橘, 驴, 闾, 榈, 女, 劬, 渠, 瞿, 蘧, 衢, 徐, 予, 余, 妤, 盂, 臾, 鱼, 禺, 俞, 谀, 娱, 狳, 雩, 渔, 萸, 隅, 渝, 揄, 逾, 愉, 腴, 虞, 觎, 愚, 瑜, 榆, 舆, 蝓]; 
v3 = [沮, 枸, 举, 莒, 矩, 龃, 踽, 吕, 侣, 捋, 旅, 偻, 铝, 屡, 缕, 膂, 褛, 履, 曲, 取, 娶, 龋, 许, 诩, 栩, 与, 予, 屿, 宇, 伛, 羽, 妪, 雨, 俣, 语, 禹, 圄, 圉, 瘐]; 
v4 = [巨, 句, 苣, 拒, 炬, 具, 剧, 俱, 距, 据, 惧, 飓, 锯, 聚, 踞, 遽, 律, 虑, 绿, 率, 滤, 恧, 去, 觑, 趣, 旭, 序, 恤, 叙, 畜, 酗, 绪, 续, 勖, 婿, 絮, 蓄, 煦, 驭, 玉, 聿, 芋, 育, 狱, 昱, 浴, 峪, 预, 谕, 欲, 域, 寓, 喻, 御, 遇, 裕, 誉, 煜, 愈, 毓, 豫, 熨, 鹬]; 
 
ai1 = [哀, 挨, 掰, 偲, 猜, 钗, 拆, 揣, 搋, 呆, 呔, 獃, 懛, 侅, 该, 陔, 郂, 荄, 垓, 乖, 摑, 嗨, 开, 揩, 拍, 塞, 腮, 鳃, 筛, 衰, 摔, 苔, 胎, 歪, 灾, 甾, 哉, 栽, 斋, 摘] 
ai2 = [皑, 癌, 白, 才, 财, 材, 裁, 犲, 侪, 柴, 豺, 喍, 膗, 叏, 孩, 骸, 怀, 徊, 淮, 槐, 踝, 来, 埋, 霾, 排, 牌, 台, 苔, 抬, 宅, 翟]; 
ai3 = [矮, 霭, 百, 佰, 柏, 捭, 摆, 毝, 采, 彩, 採, 睬, 踩, 茝, 揣, 歹, 歺, 逮, 傣, 忋, 改, 絠, 拐, 柺, 罫, 箉, 海, 胲, 烸, 酼, 醢, 凯, 恺, 铠, 慨, 剻, 买, 乃, 奶, 氖, 甩, 崴, 仔, 宰, 载, 崽, 窄]; 
ai4 = [艾, 爱, 隘, 媛, 碍, 暧, 礙, 败, 拜, 猈, 稗, 粺, 薭, 菜, 蔡, 宷, 虿, 瘥, 袃, 揣, 踹, 膪, 啜, 代, 轪, 迨, 帒, 骀, 岱, 绐, 待, 贷, 带, 玳, 殆, 怠, 蚮, 袋, 跢, 黛, 戴, 丐, 乢, 匄, 芥, 钙, 盖, 溉, 戤, 概, 夬, 怪, 恠, 亥, 妎, 骇, 害, 氦, 坏, 忾, 块, 快, 侩, 哙, 筷, 赖, 癞, 籁, 睐, 迈, 麦, 卖, 脉, 奈, 柰, 耐, 鼐, 派, 塞, 赛, 晒, 帅, 率, 蟀, 太, 汰, 肽, 态, 钛, 泰, 酞, 外, 再, 在, 载, 债, 砦, 寨, 拽]; 
 
ei1 = [陂, 卑, 杯, 柸, 背, 盃, 桮, 椑, 揹, 悲, 鹎, 碑, 藣, 鵯, 欸, 誒, 飞, 妃, 非, 菲, 啡, 婓, 婔, 绯, 扉, 暃, 蜚, 鲱, 霏, 馡, 黑, 嘿, 潶, 勒, 呸, 胚, 醅, 危, 威, 隈, 逶, 葳, 崴, 煨, 微, 巍]; 
ei2 = [肥, 淝, 腓, 蜰, 雷, 傫, 缧, 擂, 镭, 羸, 没, 枚, 玫, 眉, 莓, 郿, 梅, 湄, 媒, 楣, 煤, 酶, 鹛, 霉, 陪, 赔, 裴, 谁, 为, 韦, 围, 圩, 闱, 违, 沩, 桅, 帷, 维, 唯, 嵬, 潍, 贼]; 
ei3 = [北, 匪, 诽, 菲, 猆, 悱, 斐, 蜚, 翡, 榧, 篚, 给, 垒, 磊, 蕾, 儡, 每, 美, 镁, 馁, 伟, 伪, 苇, 尾, 续, 炜, 委, 玮, 娓, 诿, 隗, 萎, 猥, 痿, 鲔]; 
ei4 = [贝, 钡, 狈, 孛, 邶, 苝, 备, 背, 钡, 被, 倍, 悖, 鄁, 琲, 惫, 棓, 辈, 焙, 蓓, 碚, 愂, 吠, 狒, 沸, 怫, 柿, 废, 肺, 费, 厞, 剕, 鼣, 濷, 肋, 泪, 类, 累, 妹, 沬, 袂, 昧, 寐, 媚, 魅, 内, 沛, 佩, 配, 辔, 卫, 为, 未, 位, 味, 胃, 畏, 谓, 尉, 喂, 猥, 蔚, 慰, 魏]; 
 
ui1 = [吹, 炊, 龡,崔, 脺, 催, 缞, 慛, 獕, 摧, 归, 圭, 妫, 龟, 邽, 规, 茥, 闺, 皈, 胿, 珪, 硅, 椝, 瑰, 鲑, 灰, 灳, 炜, 诙, 咴, 挥, 拻, 洃, 袆, 虺, 珲, 晖, 豗, 堕, 婎, 辉, 睢, 麾, 徽, 隳, 亏, 悝, 盔, 窥, 谁, 虽, 瞧, 濉, 推, 隹, 追, 骓, 椎, 锥]; 
ui2 = [垂, 隀, 揰, 搥, 棰, 椎, 圌, 锤, 槌, 笙, 顀, 回, 佪, 廻, 茴, 恛, 洄, 蚘, 烠, 痐, 蛔, 蛕, 奎, 隗, 逵, 揆, 葵, 魁, 睽, 夔, 蕤, 绥, 隋, 随, 遂, 髓, 颓]; 
ui3 = [璀, 皠, 趡, 氿, 宄, 轨, 庋, 诡, 姽, 恑, 攱, 癸, 鬼, 祪, 晷, 湀, 蛫, 簋, 虺, 悔, 毁, 傀, 跬, 蕊, 水, 髓, 腿, 觜, 嘴]; 
ui4 = [脆, 倅, 萃, 啐, 淬, 悴, 焠, 瘁, 翠, 粹, 膬, 竁, 襊, 濢, 攰, 昋, 刿, 刽, 炅, 炔, 柜, 贵, 桂, 桧, 椢, 猤, 筀, 跪, 瞆, 螝, 鳜, 卉, 屶, 屷, 汇, 讳, 会, 泋, 浍, 绘, 哕, 诲, 荟, 芔, 贿, 烩, 桧, 恚, 晦, 彗, 秽, 惠, 喙, 阓, 慧, 匮, 馈, 溃, 愧, 聩, 芮, 锐, 蚋, 睿, 瑞, 税, 睡, 说, 岁, 祟, 遂, 碎, 隧, 穗, 燧, 邃, 退, 蜕, 褪, 坠, 缀, 缒, 惴, 赘, 最, 罪, 醉]; 
 
ao1 = [凹, 柪, 梎, 包, 苞, 孢, 枹, 胞, 剥, 笣, 龅, 褒, 杓, 标, 飑, 彪, 淲, 猋, 摽, 骠, 镖, 飙, 飚, 操, 糙, 抄, 怊, 欩, 钞, 超, 焯, 刀, 叨, 忉, 氘, 舠, 鱽, 刁, 叼, 汈, 刟, 虭, 凋, 貂, 碉, 鲷, 雕, 羔, 皋, 高, 膏, 糕, 睾, 篙, 鼛, 鷎, 茠, 蒿, 薅, 薧, 交, 郊, 茭, 骄, 娇, 姣, 浇, 胶, 教, 焦, 椒, 蛟, 跤, 鲛, 蕉, 礁, 尻, 捞, 撩, 猫, 喵, 孬, 抛, 泡, 剽, 嘌, 漂, 缥, 飘, 悄, 硗, 跷, 敲, 锹, 橇, 娆, 搔, 骚, 缫, 捎, 烧, 梢, 稍, 蛸, 艄, 鞘, 叨, 涛, 绦, 焘, 滔, 韬, 佻, 挑, 祧, 肖, 枭, 哓, 削, 骁, 绡, 宵, 逍, 销, 硝, 蛸, 箫, 潇, 霄, 魈, 幺, 天, 吆, 妖, 腰, 遭, 糟, 钊, 招, 昭, 着, 啁, 朝]; 
ao2 = [敖, 隞, 蔜, 遨,獓, 熬,獒,螯, 翱, 鳌, 嚣,鏖, 鷔,雹, 薄, 嫑, 曹, 嘈, 漕, 槽,牊, 晁, 巢, 朝, 鼌, 漅, 潮, 樔, 嘲, 捯, 毜, 蚝, 毫, 椃, 獆, 貉, 豪, 嗥, 濠, 壕, 嚎, 蠔, 籇, 矫, 嚼, 劳, 牢, 涝, 崂, 痨, 潦, 醪, 辽, 疗, 聊, 僚, 寥, 潦, 缭, 鹩, 髎, 毛, 矛, 茅, 旄, 锚, 楙, 髦, 牦, 蟊, 苗, 描, 瞄, 挠, 蛲, 铙, 刨, 庖, 袍, 嫖, 瓢, 乔, 侨, 荞, 桥, 谯, 憔, 樵, 瞧, 饶, 勺, 芍, 苕, 韶, 洮, 逃, 陶, 桃, 淘, 萄, 啕, 条, 苕, 迢, 调, 髫, 崤, 爻, 尧, 肴, 姚, 窑, 摇, 谣, 徭, 遥, 瑶, 凿, 着]; 
ao3 = [袄, 媪,宝, 饱, 怉, 鸨, 保, 葆, 堡, 堢, 媬, 褓, 寳, 表, 婧, 裱, 褾, 艸, 草, 愺, 懆, 吵, 炒, 眧, 焣, 煼, 导, 岛, 陦, 捣, 倒, 褥, 裯, 蹈, 扚, 屌, 夰, 杲, 搞, 缟, 槁, 暠, 稿, 镐, 檺, 好, 郝, 角, 侥, 佼, 狡, 饺, 绞, 皎, 脚, 矫, 搅, 剿, 缴, 考, 拷, 烤, 老, 佬, 姥, 了, 瞭, 燎, 卯, 昴, 铆, 秒, 眇, 渺, 缈, 淼, 藐, 邈, 恼, 脑, 鸟, 袅, 嬲, 跑, 殍, 巧, 扰, 扫, 嫂, 少, 讨, 窕, 挑, 小, 晓, 杳, 咬, 窈, 舀, 早, 枣, 蚤, 澡, 藻, 爪, 找, 沼]; 
ao4 = [拗, 岰, 傲, 奥, 骜, 嫯, 慠, 懊, 墺, 澳, 鏊, 鷔,勽, 刨, 报, 抱, 铇, 豹, 趵,蚫,菢, 鲍, 骲,髱, 暴, 爆, 曝, 俵, 摽, 鳔, 肏, 鄵, 襙, 鼜, 仦, 仯, 耖, 觘, 到, 倒, 帱, 悼, 焘, 菿, 盗, 道, 翢, 稻, 艔, 檤, 弔, 吊, 钓, 窎, 调, 掉, 藋, 告, 郜, 勂, 诰, 峼, 祮, 号, 昊, 昦, 侴, 秏, 悎, 耗, 哠, 浩, 恏, 晧, 傐, 皓, 鄗, 聕, 滈, 暤, 皜, 澔, 镐, 颢, 灏, 叫, 觉, 较, 教, 窖, 酵, 徼, 醮, 铐, 犒, 靠, 涝, 唠, 烙, 嗠, 酷, 嫪, 料, 廖, 撂, 镣, 茂, 冒, 贸, 袤, 帽, 瑁, 貌, 懋, 妙, 庙, 缪, 闹, 淖, 尿, 泡, 炮, 疱, 票, 骠, 漂, 壳, 俏, 诮, 峭, 窍, 翘, 撬, 鞘, 绕, 扫, 燥, 臊, 邵, 绍, 哨, 套, 眺, 粜, 跳, 孝, 肖, 哮, 笑, 校, 效, 啸, 要, 药, 钥, 曜, 耀, 灶, 皂, 造, 噪, 燥, 躁, 兆, 诏, 赵, 棹, 罩, 照, 肇]; 
 
ou1 = [抽, 紬, 搊, 篘, 瘳, 吺, 剅, 兜, 蔸, 篼, 勾, 沟, 佝, 枸, 钩, 痀, 袧, 缑, 篝, 鞲, 齁, 抠, 搂, 哞, 讴, 沤, 欧, 殴, 瓯, 鸥, 剖, 娝, 收, 叟, 搜, 嗖, 溲, 艘, 偷, 优, 忧, 攸, 呦, 幽, 悠, 州, 舟, 谄, 周, 洲, 啁, 粥, 邹, 驺, 陬, 诹, 鲰]; 
ou2 = [仇, 俦, 帱, 栦, 菗, 绸, 惆, 畴, 愁, 稠, 筹, 酬, 酧, 裯, 踌, 雔, 唞, 紑, 侯, 矦, 葔, 喉, 猴, 篌, 骺, 翭, 娄, 偻, 楼, 蝼, 牟, 谋, 眸, 鍪, 羺, 抔, 柔, 揉, 蹂, 熟, 头, 投, 骰, 尤, 由, 邮, 犹, 油, 疣, 柚, 莸, 铀, 蚰, 鱿, 蝣, 妯, 轴]; 
ou3 = [丑, 吜, 杻, 杽, 瞅, 醜, 矁, 斗, 阧, 抖, 陡, 蚪, 缶, 否, 妚, 缻, 缹, 雬, 殕, 芶, 苟, 狗, 岣, 耈, 枸, 玽, 蚼, 笱, 豿, 吼, 犼, 搂, 篓, 某, 呕, 偶, 耦, 藕, 掊, 手, 首, 守, 叟, 瞍, 薮, 擞, 友, 有, 酉, 莠, 牖, 黝, 肘, 帚, 走]; 
ou4 = [臭, 臰, 遚, 殠, 凑, 辏, 榛, 腠, 豆, 逗, 渎, 酘, 脰, 痘, 閗, 窦, 诟, 坸, 购, 构, 姤, 垢, 冓, 够, 啂, 雊, 彀, 媾, 煹, 觏, 后, 郈, 厚, 茩, 逅, 堠, 豞, 鲎, 鲘, 叩, 扣, 寇, 蔲, 陋, 漏, 镂, 瘘, 露, 耨, 獳, 沤, 怄, 肉, 寿, 受, 狩, 兽, 售, 授, 绶, 瘦, 嗽, 透, 又, 右, 幼, 佑, 侑, 囿, 柚, 宥, 诱, 釉, 鼬, 纣, 咒, 宙, 胄, 昼, 皱, 骤, 繇, 籀, 奏, 揍]; 
 
iu1 = [丢, 铥, 颩, 纠, 鸠, 究, 赳, 阄, 啾, 揪, 溜, 蹓, 熘, 妞, 丘, 邱, 秋, 蚯, 湫, 鳅, 休, 修, 咻, 羞, 馐]; 
iu2 = [刘, 浏, 流, 留, 琉, 硫, 骝, 榴, 瘤, 牛, 囚, 虬, 求, 泅, 酋, 逑, 球, 遒, 裘]; 
iu3 = [九, 久, 灸, 韭, 酒, 柳, 绺, 锍, 狃, 扭, 钮, 糗, 朽, 宿]; 
iu4 = [旧, 臼, 疚, 咎, 柩, 救, 就, 舅, 鹫, 六, 溜, 鹨, 谬, 缪, 拗, 秀, 岫, 绣, 袖, 锈, 嗅]; 
 
ie1 = [憋, 瘪, 蟞, 鳖, 爹, 跌, 褺, 阶, 疖, 皆, 接, 揭, 街, 揭, 嗟, 咩, 捏, 撇, 暼, 瞥, 切, 贴, 帖, 些, 楔, 歇, 蝎]; 
ie2 = [别, 莂, 蛂, 徶, 蹩, 苵, 迭, 咥, 峌, 挕, 绖, 垤, 昳, 瓞, 眣, 耋, 谍, 眰, 趎, 跕, 畳, 喋, 惵, 叠, 牃, 碟, 殜, 蝶, 螲, 节, 劫, 杰, 诘, 狤, 洁, 拮, 桀, 婕, 捷, 颉, 截, 碣, 竭, 羯, 伽, 茄, 邪, 协, 胁, 挟, 斜, 谐, 携, 撷]; 
ie3 = [瘪, 姐, 解, 撇, 且, 铁, 写, 血]; 
ie4 = [彆, 哋, 介, 芥, 戒, 届, 玠, 疥, 界, 诫, 借, 列, 劣, 冽, 洌, 烈, 烮, 猎, 裂, 灭, 蔑, 篾, 乜, 涅, 聂, 臬, 镊, 镍, 蹑, 孽, 切, 妾, 怯, 窃, 挈, 惬, 趄, 慊, 锲, 箧, 餮, 泄, 绁, 泻, 卸, 屑, 械, 亵, 谢, 解, 榭, 獬, 懈, 邂, 蟹, 瀣, 燮]; 
 
ve1 = [噘, 撅, 炔, 缺, 削, 靴, 薛, 曰, 约]; 
ve2 = [决, 诀, 抉, 绝, 觉, 倔, 厥, 爵, 蹶, 瘸, 穴, 学]; 
ve3 = [雪, 鳕, 哕]; 
ve4 = [略, 掠, 疟, 虐, 却, 雀, 确, 阕, 阙, 鹊, 榷, 谑, 月, 乐, 刖, 岳, 栎, 钥, 铖, 阅, 悦, 跃, 越, 粤]; 
 
er1 = [乻]; 
er2 = [儿, 而, 児, 栭, 胹, 鸸, 鲕]; 
er3 = [尔, 尒, 耳, 迩, 饵, 洱, 毦, 栮, 珥, 铒]; 
er4 = [二, 弍, 贰, 髶, 樲]; 
 
an1 = [安, 氨, 庵, 谙, 萻, 鹌, 鞍, 偣, 扳, 朌, 攽, 班, 般, 颁, 斑, 搬, 螌, 边, 笾, 编, 鞭, 鳊, 鞭, 参, 骖, 湌, 喰, 傪, 餐, 觇, 掺, 搀, 裧, 幨, 襜, 巛, 川, 氚, 穿, 瑏, 汆, 撺, 蹿, 丹, 妉, 担, 单, 耽, 郸, 聃, 躭, 酖, 殚, 瘅, 箪, 儋, 擔, 敁, 掂, 厧, 嵮, 滇, 颠, 巅, 癫, 耑, 端, 媏, 褍, 帆, 忛, 番, 蕃, 嬏, 旙, 翻, 藩, 籓, 干, 甘, 杆, 肝, 玕, 姏, 泔, 苷, 坩, 竿, 柑, 酐, 疳, 粓, 尴, 尲, 关, 观, 纶, 官, 冠, 倌, 棺, 鳏,  蚶, 酣, 憨, 馠, 鼾, 欢, 犿, 狟, 嚾, 獾, 懽, 貛, 尖, 戋, 奸, 间, 歼, 坚, 肩, 艰, 兼, 监, 菅, 蒹, 煎, 鲣, 鹣, 娟, 捐, 涓, 鹃, 刊, 龛, 勘, 堪, 戡, 宽, 髋, 囝, 囡, 拈, 蔫, 潘, 攀, 偏, 翩, 篇, 千, 阡, 芊, 迁, 钎, 牵, 悭, 铅, 谦, 愆, 骞, 搴, 悛, 圈, 三, 山, 删, 杉, 衫, 姗, 舢, 栅, 珊, 扇, 煽, 潸, 膻, 闩, 拴, 栓, 狻, 酸, 贪, 滩, 瘫, 天, 添, 湍, 弯, 剜, 湾, 蜿, 豌, 仙, 纤, 先, 氙, 掀, 鲜, 暹, 轩, 宣, 谖, 萱, 喧, 咽, 烟, 胭, 焉, 淹, 阉, 腌, 嫣, 燕, 鸢, 冤, 鸳, 渊, 簪, 糌, 专, 砖, 颛, 钻, 躜, 占, 沾, 毡, 旃, 粘, 詹, 瞻]; 
an2 = [儑, 残, 蚕, 惭, 苂, 谗, 婵, 馋, 湹, 孱, 棎, 禅, 煘, 缠, 蝉, 潺, 潹, 澶, 蟾, 传, 舡, 舩, 船, 剶, 遄, 椽, 傳, 暷, 篅, 菆, 攒, 櫕, 巑, 欑, 穳, 凡, 匥, 杋, 钒, 矾, 籵, 舤, 烦, 笲, 棥, 繁, 樊, 燔, 羳, 蹯, 蘩, 邗, 邯, 含, 函, 焓, 晗, 琀, 涵, 崡, 崴, 寒, 韩, 筨, 还, 郇, 环, 荁, 峘, 洹, 桓, 萑, 萑, 獂, 羦, 寰, 嬛, 阛, 鹮, 煨, 鬟, 兰, 岚, 拦, 栏, 婪, 阑, 蓝, 澜, 篮, 连, 奁, 怜, 帘, 涟, 莲, 裢, 联, 廉, 鲢, 娈, 峦, 孪, 栾, 鸾, 脔, 銮, 蛮, 馒, 瞒, 鳗, 眠, 绵, 棉, 男, 南, 难, 喃, 楠, 年, 粘, 鲇, 黏, 奻, 盘, 磐, 蹒, 蟠, 骈, 胼, 前, 钱, 虔, 乾, 潜, 黔, 全, 权, 诠, 荃, 泉, 拳, 痊, 筌, 蜷, 醛, 颧, 然, 髯, 燃, 坛, 昙, 郯, 谈, 弹, 覃, 痰, 谭, 澹, 檀, 田, 恬, 畋, 甜, 阗, 团, 抟, 丸, 纨, 完, 玩, 顽, 烷, 闲, 弦, 贤, 咸, 娴, 衔, 舷, 嫌, 玄, 悬, 旋, 漩, 璇, 延, 妍, 严, 言, 岩, 沿, 炎, 妍, 研, 盐, 阎, 蜒, 筵, 颜, 檐, 元, 沅, 园, 员, 芫, 垣, 爰, 袁, 圆, 原, 媛, 援, 鼋, 缘, 源, 猿, 辕, 螈, 咱]; 
an3 = [俺, 埯, 晻, 罯, 阪, 岅, 板, 坂, 版, 昄, 闆, 贬, 扁, 匾, 褊, 惨, 憯, 黪, 产, 刬, 旵, 丳, 斺, 浐, 谄, 阐, 铲, 舛, 喘, 僢, 踳, 瓭, 胆, 疸, 掸, 亶, 玬, 典, 点, 奌, 碘, 蒧, 短, 反, 払, 仮, 返, 橎, 杆, 秆, 赶, 笴, 桿, 敢, 感, 澉, 橄, 澸, 擀, 鳡, 莞, 馆, 筦, 管, 罕, 浫, 喊, 蔊, 豃, 缓, 睆, 囝, 拣, 俭, 茧, 柬, 捡, 减, 剪, 检, 锏, 简, 戬, 碱, 翦, 蹇, 卷, 坎, 侃, 砍, 槛, 款, 览, 揽, 缆, 榄, 懒, 敛, 琏, 脸, 卵, 满, 螨, 丐, 免, 勉, 眄, 渑, 冕, 缅, 腼, 郝, 捻, 辗, 暖, 浅, 遗, 谴, 缱, 犬, 绻, 冉, 苒, 染, 阮, 软, 伞, 散, 闪, 陕, 忐, 坦, 毯, 忝, 殄, 腆, 舔, 疃, 宛, 莞, 挽, 绾, 惋, 婉, 脘, 晚, 晚, 琬, 皖, 碗, 险, 冼, 显, 猃, 铣, 跣, 藓, 选, 癣, 奄, 兖, 俨, 衍, 剡, 眼, 偃, 郾, 琰, 演, 远, 昝, 攒, 趱, 斩, 盏, 展, 崭, 搌, 辗, 转, 缵, 纂]; 
an4 = [犴, 岸, 按, 胺, 案, 豻, 隌, 暗, 闇, 黯,办, 半, 伴, 扮, 拌, 姅, 绊, 坢, 柈, 秚, 靽, 辦, 瓣, 卞, 弁, 汴, 忭, 变, 昪, 便, 辨, 辩, 辫, 灿, 孱, 粲, 澯, 燦, 璨, 忏, 刬, 硟, 懴, 颤, 羼, 串, 钏, 猭, 窜, 殩, 熶, 篡, 竄, 旦, 但, 诞, 狚, 担, 泹, 沊, 蛋, 惮, 啖, 啗, 弹, 淡, 萏, 氮, 腅, 觛, 电, 甸, 阽, 佃, 店, 坫, 垫, 扂, 玷, 钿, 惦, 淀, 琔, 奠, 殿, 靛, 簟, 驔, 段, 断, 葮, 缎, 塅, 煅, 瑖, 锻, 簖, 犯, 饭, 泛, 贩, 范, 畈, 梵, 干, 汵, 旰, 盰, 绀, 倝, 淦, 骭, 赣, 灨, 卝, 毌, 丱, 观, 贯, 泴, 掼, 涫, 惯, 盥, 雚, 灌, 瓘, 鹳, 罐, 厈, 汉, 汗, 屽, 闬, 旱, 悍, 唅, 猂, 莟, 捍, 菡, 焊, 皔, 晗, 颔, 蜭, 憾, 翰, 撼, 瀚, 幻, 肒, 奂, 宦, 唤, 换, 涣, 浣, 焕, 梙, 逭, 患, 嵈, 痪, 豢, 鲩, 擐, 鰀, 见, 件, 间, 建, 饯, 贱, 荐, 剑, 舰, 健, 涧, 渐, 谏, 毽, 腱, 践, 溅, 鉴, 键, 槛, 僭, 箭, 卷, 倦, 隽, 眷, 看, 瞰, 烂, 滥, 练, 炼, 恋, 殓, 链, 潋, 乱, 曼, 谩, 幔, 蔓, 漫, 慢, 面, 难, 廿, 念, 判, 泮, 盼, 叛, 畔, 袢, 片, 骗, 欠, 纤, 茜, 倩, 堑, 嵌, 歉, 劝, 券, 散, 讪, 钐, 汕, 扇, 善, 禅, 缮, 擅, 膳, 赡, 蟮, 鳝, 涮, 蒜, 算, 叹, 炭, 探, 碳, 彖, 万, 腕, 县, 苋, 岘, 限, 现, 线, 宪, 陷, 馅, 羡, 腺, 献, 霰, 炫, 绚, 眩, 渲, 厌, 砚, 咽, 彦, 唁, 验, 宴, 艳, 晏, 谚, 焰, 焱, 堰, 雁, 滟, 燕, 苑, 院, 怨, 掾, 愿, 暂, 赞, 瓒, 占, 战, 栈, 站, 绽, 湛, 传, 转, 赚, 馔, 撰, 篆, 钻, 赚, 攥]; 
 
en1 = [奔, 泍, 贲, 锛, 参, 嵾, 抻, 郴, 捵, 棽, 琛, 嗔, 奀, 恩, 蒽, 煾, 分, 芬, 帉, 吩, 纷, 氛, 玢, 翂, 躮, 酚, 雰, 馚, 根, 跟, 闷, 喷, 森, 申, 伸, 身, 参, 呻, 绅, 娠, 莘, 砷, 深, 温, 瘟, 贞, 针, 侦, 帧, 浈, 胗, 珍, 桢, 真, 砧, 斟, 溱, 甄, 祯, 榛, 箴, 臻]; 
en2 = [岑, 涔, 埁, 笒, 梣, 尘, 臣, 辰, 忱, 沉, 陈, 茝, 莀, 莐, 宸, 桭, 谌, 晨, 愖, 煁, 塵, 瘎, 霃, 妢, 岎, 汾, 坟, 炃, 朌, 枌, 羒, 蚠, 蚡, 焚, 棼, 鼢, 哏, 拫, 痕, 鞎, 门, 们, 扪, 盆, 人, 仁, 壬, 任, 神, 什, 文, 纹, 蚊, 雯]; 
en3 = [本, 苯, 奙, 翉, 畚, 榀, 趻, 硶, 碜, 夦, 峎, 粉, 黺, 艮, 很, 狠, 佷, 肯, 恳, 啃, 忍, 荏, 稔, 沈, 审, 哂, 矧, 谂, 婶, 刎, 吻, 紊, 稳, 怎, 诊, 枕, 轸, 胗, 疹, 畛, 缜, 稹]; 
en4 = [夯, 坌, 逩, 倴, 桳, 笨, 渀, 衬, 疢, 称, 龀, 趁, 趂, 榇, 谶, 嚫, 儭, 扽, 摁, 份, 弅, 鳱, 忿, 奋, 秎, 偾, 粪, 愤, 亘, 艮, 茛, 搄, 恨, 闷, 焖, 懑, 恁, 嬾, 喯, 刃, 认, 仞, 任, 纫, 妊, 韧, 衽, 葚, 肾, 甚, 渗, 慎, 椹, 蜃, 问, 汶, 谮, 阵, 圳, 鸩, 振, 朕, 赈, 镇, 震]; 
 
in1 = [邠, 宾, 彬, 梹, 椕, 斌, 滨, 缤, 槟, 瑸, 镔, 濒, 豳, 豩, 虨, 巾, 今, 斤, 金, 矜, 津, 筋, 襟, 拎, 拼, 姘, 侵, 亲, 钦, 衾, 心, 辛, 芯, 莘, 锌, 歆, 薪, 馨, 鑫, 因, 阴, 茵, 姻, 音, 氤, 殷, 喑]; 
in2 = [邻, 聆, 阾, 林, 临, 淋, 琳, 霖, 磷, 鳞, 麟, 民, 岷, 旻, 您, 贫, 玭, 频, 芹, 芩, 秦, 禽, 琴, 勤, 擒, 噙, 吟, 垠, 银, 淫, 寅, 龈, 霪]; 
in3 = [仅, 紧, 堇, 谨, 锦, 凛, 懔, 廪, 皿, 闵, 抿, 泯, 闽, 悯, 敏, 愍, 品, 寝, 引, 尹, 饮, 蚓, 吲, 隐, 瘾]; 
in4 = [摈, 殡, 膑, 鬂, 髌, 鬓, 尽, 劲, 进, 近, 浸, 烬, 晋, 禁, 吝, 赁, 蔺, 躏, 牝, 聘, 沁, 揿, 囟, 芯, 信, 衅, 印, 荫, 胤, 窨]; 
 
un1 = [旾, 杶, 春, 媋, 堾, 椿, 槆, 暙, 瑃, 暙, 箺, 鰆, 邨, 村, 皴, 踆, 澊, 竴, 吨, 惇, 敦, 蜳, 墩, 镦, 礅, 蹲, 蹾, 衮, 绲, 惃, 辊, 滚, 鲧, 磙, 鮌, 昏, 荤, 阍, 婚, 涽, 坤, 昆, 堃, 崐, 髡, 鹍, 抡, 孙, 狲, 飧, 吞, 谆, 尊, 遵, 樽, 鳟]; 
un2 = [纯, 陙, 莼, 唇, 浱, 脣, 淳, 鹑, 滣, 醇, 存, 侟, 拵, 忶, 浑, 珲, 混, 馄, 魂, 仑, 伦, 沦, 纶, 囮, 黁, 屯, 囤, 豚, 臀]; 
un3 = [偆, 惷, 睶, 蠢, 刌, 忖, 盹, 趸, 躉, 圂, 溷, 诨, 俒, 捆, 吮, 笋, 损, 隼, 氽, 准, 撙]; 
un4 = [寸, 伅, 庉, 沌, 囤, 炖, 逇, 钝, 盾, 顿, 遁, 楯, 燉, 踲, 棍, 睔, 倱, 婫, 混, 困, 论, 闰, 润, 顺, 舜, 瞬]; 
 
vn1 = [军, 君, 均, 钧, 菌, 逡, 勋, 埚, 熏, 曛, 晕, 熳, 氲]; 
vn2 = [裙, 群, 麇, 巡, 寻, 旬, 荨, 洵, 峋, 恂, 循, 鲟, 匀, 云, 芸, 纭, 筠]; 
vn3 = [允, 狁, 陨, 殒]; 
vn4 = [郡, 俊, 骏, 浚, 隽, 竣, 濬, 讯, 训, 迅, 驯, 汛, 逊, 巽, 殉, 浚, 孕, 运, 郓, 恽, 晕, 酝, 愠, 韵, 熨, 蕴]; 
 
ang1 = [肮, 骯, 帮, 邦, 垹, 梆, 浜, 捠, 崩, 绷, 痭, 嵭, 仓, 苍, 沧, 鸧, 舱, 伥, 昌, 倡, 菖, 娼, 猖, 淐, 琩, 锠, 裮, 鲳, 鼚, 疮, 窗, 牎, 摐, 当, 珰, 裆, 铛, 方, 芳, 汸, 坊, 枋, 冈, 冮, 刚, 纲, 岗, 肛, 疘, 矼, 牨, 钢, 缸, 罡, 光, 灮, 炗, 炚, 炛, 茪, 咣, 姯, 烡, 桄, 胱, 僙, 黆, 夯, 巟, 肓, 荒, 宺, 朚, 慌, 塃, 江, 将, 姜, 浆, 豇, 僵, 缰, 疆, 康, 慷, 糠, 匡, 诓, 筐, 牤, 邙, 囔, 乓, 滂, 羌, 枪, 戗, 跄, 腔, 锵, 嚷, 丧, 桑, 伤, 殇, 商, 觞, 墒, 熵, 双, 泷, 霜, 孀, 汤, 趟, 镗, 汪, 乡, 相, 香, 厢, 湘, 箱, 襄, 骧, 镶, 央, 泱, 殃, 秧, 鸯, 鞅, 赃, 脏, 臧, 张, 章, 鄣, 獐, 彰, 漳, 樟, 璋, 蟑, 庄, 妆, 桩, 装]; 
ang2 = [卬, 昂, 甭, 藏, 臧, 长, 仧, 仩, 场, 肠, 苌, 尝, 偿, 徜, 常, 裳, 嫦, 瑺, 床, 牀, 幢, 噇, 防, 妨, 房, 肪, 鲂, 坊, 行, 迒, 杭, 绗, 桁, 珩, 蚢, 航, 笐, 颃, 裄, 皇, 隍, 凰, 偟, 黄, 徨, 遑, 媓, 惶, 煌, 瑝, 潢, 獚, 熿, 蝗, 璜, 艎, 篁, 穔, 磺, 蟥, 簧, 鳇, 趪, 鷬, 扛, 狂, 诳, 郎, 狼, 桹, 廊, 琅, 稂, 锒, 螂, 良, 凉, 梁, 量, 粮, 粱, 芒, 忙, 尨, 氓, 盲, 笀, 茫, 囊, 娘, 彷, 庞, 旁, 徬, 螃, 鳑, 强, 嫱, 墙, 樯, 穰, 瓤, 唐, 堂, 棠, 塘, 膛, 糖, 镗, 螳, 亡, 王, 降, 详, 祥, 翔, 阳, 扬, 羊, 杨, 炀, 疡, 佯, 洋]; 
ang3 = [绑, 榜, 牓, 膀, 埄, 埲, 菶, 琫, 琣, 鞛, 厂, 场, 昶, 敞, 氅, 闯, 傸, 挡, 党, 谠, 访, 仿, 纺, 昉, 眆, 舫, 岗, 港, 广, 広, 犷, 臩, 怳, 恍, 炾, 晃, 晄, 谎, 奛, 慌, 幌, 熀, 櫎, 讲, 奖, 桨, 蒋, 夼, 朗, 两, 俩, 魉, 莽, 蟒, 馕, 抢, 羟, 壤, 嚷, 嗓, 晌, 赏, 爽, 倘, 淌, 傥, 躺, 网, 往, 罔, 枉, 惘, 辋, 魍, 享, 响, 饷, 想, 仰, 养, 氧, 痒, 长, 涨, 掌]; 
ang4 = [枊, 盎, 醠, 玤, 蚌, 棒, 棓, 傍, 谤, 蒡, 搒, 塝, 稖, 迸, 泵, 蚌, 揼, 塴, 蹦, 镚, 賶, 怅, 玚, 畅, 倡, 唱, 焻, 创, 怆, 刱, 剙, 氹, 宕, 砀, 荡, 档, 逷, 嵣, 放, 杠, 筻, 槓, 戆, 俇, 逛, 臦, 沆, 晃, 滉, 愰, 蟥, 皝, 皩, 匠, 降, 绛, 酱, 犟, 糨, 亢, 伉, 抗, 炕, 邝, 况, 旷, 矿, 框, 眶, 阆, 浪, 亮, 谅, 晾, 靓, 踉, 辆, 齉, 酿, 胖, 呛, 跄, 让, 丧, 上, 尚, 绱, 烫, 趟, 妄, 忘, 旺, 望, 向, 相, 象, 像, 橡, 巷, 怏, 恙, 烊, 样, 漾, 葬, 藏, 丈, 仗, 帐, 杖, 胀, 账, 障, 嶂, 瘴, 壮, 状, 奘, 僮, 幢, 撞]; 
 
eng1 = [噌, 阷, 泟, 爯, 怪, 棦, 称, 秤, 浾, 琤, 碀, 蛏, 赪, 靗, 憆, 撑, 噌, 樘, 瞠, 灯, 登, 噔, 璒, 蹬, 簦, 竳, 鞥, 丰, 风, 凨, 仹, 枫, 疯, 砜, 封, 峰, 桻, 堼, 崶, 锋, 蜂, 篈, 鄷, 更, 刯, 庚, 畊, 耕, 浭, 赓, 焿, 鹒, 羹, 亨, 哼, 脝, 涥, 悙, 吭, 坑, 铿, 蒙, 抨, 怦, 砰, 烹, 嘭, 扔, 僧, 升, 生, 声, 牲, 笙, 甥, 翁, 嗡, 曾, 增, 缯, 憎, 罾, 正, 争, 诤, 征, 怔, 政, 挣, 狰, 峥, 钲, 症, 睁, 铮, 筝, 蒸, 鲭]; 
eng2 = [层, 曾, 嶒, 層, 竲, 丞, 成, 朾, 呈, 诚, 枨, 承, 荿, 宬, 娍, 峸, 洆, 城, 埕, 珹, 程, 铖, 揨, 筬, 惩, 塍, 塖, 溗, 酲, 澄, 澂, 憕, 橙, 檙, 懲, 冯, 沨, 逢, 缝, 摓, 恒, 姮, 珩, 胻, 烆, 桁, 鸻, 撗, 横, 衡, 蘅, 棱, 尨, 虻, 萌, 蒙, 盟, 濛, 鹲, 能, 朋, 彭, 棚, 蓬, 鹏, 澎, 篷, 仍, 绳, 疼, 腾, 滕, 藤]; 
eng3 = [逞, 骋, 悜, 等, 戥, 讽, 唪, 郠, 莄, 哽, 梗, 峺, 绠, 耿, 鲠, 骾, 冷, 猛, 锰, 蜢, 捧, 省, 眚, 拯, 整]; 
eng4 = [蹭, 称, 秤, 牚, 邓, 隥, 凳, 墱, 瞪, 凤, 奉, 傣, 葑, 湗, 焨, 更, 堩, 暅, 啈, 横, 愣, 楞, 孟, 梦, 碰, 艿, 圣, 胜, 晟, 乘, 剩, 盛, 瓮, 锃, 缯, 赠, 甑, 正, 证, 郑, 怔, 政, 症, 铮]; 
 
ing1 = [仌, 并, 冰, 兵, 栟, 掤, 槟, 丁, 仃, 叮, 玎, 钉, 盯, 疔, 町, 虰, 耵, 酊, 靪, 泾, 京, 茎, 径, 经, 荆, 旌, 菁, 稉, 晶, 晴, 粳, 兢, 鲸, 乒, 娉, 青, 轻, 氢, 卿, 倾, 清, 蜻, 鲭, 厅, 汀, 町, 听, 烃, 兴, 星, 猩, 惺, 腥, 应, 英, 莺, 婴, 瑛, 嘤, 缨, 撄, 罂, 樱, 鹦, 膺]; 
ing2 = [伶, 灵, 玲, 囹, 苓, 泠, 瓴, 铃, 陵, 菱, 凌, 聆, 翎, 绫, 羚, 棱, 龄, 零, 鲮, 名, 明, 鸣, 茗, 冥, 铭, 溟, 暝, 瞑, 宁, 狞, 咛, 拧, 柠, 甯, 平, 苹, 凭, 坪, 屏, 瓶, 萍, 情, 氰, 晴, 擎, 黥, 廷, 庭, 亭, 停, 婷, 蜓, 霆, 刑, 邢, 行, 陉, 形, 荥, 型, 迎, 茔, 荥, 荧, 盈, 莹, 萤, 营, 萦, 滢, 楹, 颖, 蝇, 赢, 瀛]; 
ing3 = [丙, 陃, 邴, 秉, 昺, 炳, 柄, 饼, 禀, 鞞, 顶, 鼎, 井, 阱, 刭, 景, 岭, 领, 酩, 拧, 请, 挺, 铤, 艇, 省, 醒, 擤, 郢, 颍, 影]; 
ing4 = [并, 並, 病, 竝, 摒, 订, 饤, 忊, 钉, 矴, 定, 铤, 萣, 啶, 腚, 锭, 劲, 迳, 静, 径, 胫, 净, 竞, 敬, 靖, 境, 镜, 另, 令, 呤, 命, 宁, 佞, 泞, 倿, 庆, 磬, 罄, 兴, 杏, 性, 幸, 姓, 荇, 悻, 应, 映, 硬, 媵]; 
 
ong1 = [冲, 充, 忡, 沖, 茺, 珫, 翀, 舂, 嘃, 憧, 艟, 蹖, 匆, 苁, 囟, 忩, 枞, 葱, 骢, 聪, 东, 冬, 咚, 岽, 昸, 氡, 鸫, 笗, 工, 弓, 公, 厷, 功, 杛, 攻, 供, 侊, 肱, 宫, 恭, 蚣, 躬, 龚, 匑, 觥, 髸, 觵, 吽, 呍, 灴, 轰, 哄, 訇, 烘, 焢, 硡, 揈, 薨, 扃, 空, 倥, 崆, 箜, 松, 忪, 淞, 嵩, 恫, 通, 凶, 兄, 匈, 芎, 汹, 胸, 拥, 佣, 邕, 痈, 庸, 墉, 慵, 壅, 臃, 鳙, 中, 忠, 终, 钟, 盅, 衷, 螽, 宗, 枞, 综, 棕, 踪, 鬃]; 
ong2 = [虫, 重, 隀, 崇, 崈, 漴, 褈, 蟲, 爞, 从, 丛, 淙, 悰, 孮, 琮, 仜, 弘, 妅, 屸, 红, 纮, 闳, 宏, 苰, 泓, 玜, 沗, 虹, 洪, 娂, 荭, 羾, 翃, 耾, 竑, 鸿, 霟, 龙, 珑, 胧, 聋, 笼, 隆, 窿, 农, 侬, 浓, 哝, 脓, 邛, 穷, 穹, 茕, 琼, 戎, 茸, 荣, 绒, 容, 溶, 榕, 熔, 仝, 同, 彤, 佟, 侗, 峒, 桐, 砼, 铜, 童, 酮, 瞳, 雄, 熊]; 
ong3 = [宠, 埫, 董, 懂, 箽, 廾, 巩, 汞, 拱, 栱, 珙, 鞏, 哄, 冏, 炅, 炯, 窘,  孔, 恐, 陇, 拢, 垄, 冗, 怂, 悚, 耸, 竦, 侗, 统, 桶, 捅, 筒, 永, 甬, 咏, 泳, 勇, 俑, 涌, 恿, 蛹, 踊, 肿, 种, 冢, 总, 偬]; 
ong4 = [铳, 冲, 揰, 衝, 惚, 憁, 动, 冻, 侗, 垌, 恫, 栋, 胨, 迵, 峒, 洞, 胴, 戙, 共, 贡, 供, 唝, 讧, 澒, 蕻, 撔, 控, 弄, 讼, 宋, 诵, 送, 颂, 恸, 痛, 用, 佣, 众, 仲, 种, 重, 纵, 粽]; 
 
'''  
  
a1 = ['阿', '啊', '八', '巴', '叭', '吧', '芭', '疤', '粑', '蚆', '笆', '捌', '羓', '豝', '鲃','擦', '攃', '嚓', '叉', '扱', '扠', '杈', '差', '插', '嗏', '艖', '欻', '哒', '耷', '搭', '褡', '发', '彂', '酦', '旮', '伽', '嘎', '瓜', '刮', '呱', '胍', '栝', '鸹', '踻', '哈', '紦', '铪', '花', '哗', '砉', '加', '夹', '伽', '佳', '迦', '珈', '枷', '家', '痂', '笳', '袈', '葭', '跏', '嘉', '咖', '咔', '喀', '夸', '拉','垃', '啦', '喇', '邋', '妈', '叭', '趴', '啪', '葩', '掐', '撒', '仨', '杀', '沙', '纱','砂', '莎', '铩', '痧', '裟', '鲨', '刷', '唰', '它', '她', '塌', '凹', '洼', '挖', '娲', '蛙',  '虾', '瞎', '压', '呀', '押', '鸦', '鸭', '桠', '匝', '咂', '扎', '吒', '查', '渣', '喳', '猹', '楂', '齄', '抓'];  
a2 = ['茇', '妭', '拔', '炦', '胈', '癹', '菝', '跋', '颰', '鬾', '鼥','茬', '茶', '查', '猹', '搽', '靫', '察', '檫', '达', '怛', '妲', '沓', '答', '跶', '靼', '鞑', '乏', '伐', '姂', '坺', '垡', '阀', '罚', '筏', '噶', '尜', '蛤', '划', '华', '呚', '哗', '骅', '姡', '猾', '滑', '搳', '磆', '螖', '荚', '颊', '旯', '磖', '麻', '蟆', '拏', '拿', '扒', '杷', '爬', '耙', '琶', '啥', '娃', '匣', '狎', '侠', '狭', '峡', '遐', '瑕', '暇', '辖', '霞', '黠', '牙', '伢', '芽', '岈', '琊', '崖', '涯', '衙', '杂', '砸', '轧', '札', '闸', '铡'];  
a3 = ['把', '钯', '靶', '礤', '衩', '打', '嗲', '法', '峜', '砝', '佱', '玍', '尕', '剐', '寡', '奤',  '贾', '假', '卡', '垮', '喇', '马', '犸', '玛', '码', '蚂', '哪', '洒', '撒', '傻', '耍', '塔', '獭', '瓦', '佤', '哑', '雅', '咋'];  
a4 = ['坝', '爸', '杷', '罢', '耙', '跁', '鲅', '靶', '罷', '霸', '壩', '灞', '欛', '遪', '奼', '汊', '杈', '岔', '刹', '侘', '诧', '姹', '差', '大', '亣', '汏', '眔', '发', '珐', '髪', '尬', '魀', '卦', '诖', '坬', '挂', '掛', '罣', '褂', '化', '夻', '话', '桦', '画', '婳', '舙', '价', '驾', '架', '嫁', '稼', '挎', '胯', '跨', '腊', '蜡', '辣', '瘌', '蝲', '骂', '蚂', '那', '呐', '纳', '娜', '钠', '衲', '捺', '帕', '怕', '恰', '洽', '髂', '飒', '萨', '厦', '煞', '歃', '霎', '拓', '沓', '挞', '送', '榻', '踏', '蹋', '袜', '下', '吓', '夏', '厦', '罅', '轧', '亚', '讶', '迓', '揠', '乍', '诈', '咤', '炸', '栅', '昨', '槎', '榨'];  
  
o1 = ['癷', '波', '拨', '玻', '饽', '钵', '盋', '砵', '剥', '趵', '菠', '啵', '溊', '蕃', '播', '嶓', '礴', '逴', '踔', '戳', '搓', '瑳', '磋', '撮', '醝', '蹉', '多', '夛', '咄', '哆', '剟', '裰', '呙', '咶', '埚', '郭', '猓', '崞', '锅', '聒', '墎', '蝈', '彉', '劐', '豁', '捋', '啰', '摸', '泊', '泼', '坡', '颇', '说', '唆', '娑', '梭', '蓑', '羧', '缩', '托', '拖', '脱', '挝', '涡', '倭', '莴', '窝', '蜗', '拙', '捉', '倬', '桌', '涿', '擢', '作', '嘬'];  
o2 = ['仢', '伯', '驳', '孛', '泊', '狛', '帛', '勃', '柏', '钹', '亳', '萡', '脖', '舶', '渤', '鹁', '博', '猼', '愽', '搏', '铂', '箔', '膊', '踣', '薄', '襮', '礴', '嵳', '睉', '蒫', '矬', '瘥', '酂', '鹾', '夺', '度', '铎', '痥', '踱', '敚', '佛', '仏', '国', '帼', '腘', '聝', '虢', '馘', '活', '罗', '萝', '逻', '锣', '骡', '箩', '螺', '谟', '馍', '淼', '模', '摹', '膜', '麽', '摩', '磨', '嬷', '魔', '娜', '傩', '婆', '鄱', '皤', '驮', '陀', '驼', '沱', '坨', '鸵', '砣', '酡', '橐', '鼍', '灼', '卓', '茁', '浊', '斫', '浞', '酌', '啄', '琢', '濯', '镯', '昨', '笮', '琢'];  
o3 = ['跛', '簸', '脞', '朵', '朶', '杕', '饳', '剁', '沲', '哚', '挆', '柮', '垛', '缍', '躲',  '果', '菒', '馃', '惈', '粿', '裹', '火', '伙', '夥', '裸', '蠃', '抹', '懡', '叵', '笸',  '所', '唢', '索', '琐', '锁', '妥', '椭', '我', '左',  '佐', '撮'];  
o4 = ['孹', '檗', '擘', '簸', '蘗', '辵', '哾', '娖', '娕', '婼', '婥', '嗓', '涰', '绰', '惙', '辍', '酫', '踀', '龊', '擉', '剉', '剒', '莝', '莡', '厝', '挫', '措', '逪', '锉', '错', '堕', '堕', '憜', '鵽', '刴', '挅', '过', '腂', '货', '获', '祸', '惑', '霍', '豁', '蠖', '镬', '扩', '括', '阔', '廓', '洛', '骆', '络', '烙', '落', '漯', '末', '没', '陌', '殁', '莫', '秣', '貊', '蓦', '默', '诺', '喏', '搦', '糑', '懦', '糯', '迫', '破', '粕', '魄', '若', '偌', '弱', '箬', '烁', '朔', '铄', '硕', '搠', '槊', '拓', '柝', '唾', '箨', '魄', '沃', '卧', '幄', '渥', '握', '斡', '龌', '坐', '作', '祚', '座', '做', '唑'];  
  
e1 = ['车', '嘚', '妸', '妿','婀', '屙', '戈', '仡', '犵', '扢', '纥', '戓', '肐', '疙', '咯', '饷', '哥', '胳', '鸽', '搁', '割', '歌', '戨', '诃', '呵', '抲', '喝', '蠚', '欱', '苛', '坷', '珂', '科', '轲', '柯', '疴', '棵', '稞', '窠', '瞌', '蝌', '磕', '颗', '了', '奢', '赊',  '耶', '掖', '椰', '噎', '蜇', '遮', '螫'];  
e2 = ['恴', '得', '淂', '棏', '悳', '德', '讹', '囮', '俄', '峉', '峨', '涐', '恶', '娥', '莪', '珴', '皒', '鹅', '蛾', '额', '呄', '佮', '茖', '阁', '挌', '革', '鬲', '格', '敋', '隔', '祴', '蛤', '蛒', '愅', '嗝', '滆', '搿', '骼', '镉', '壳', '咳', '舌', '佘', '蛇', '揲', '爷', '揶', '则', '泽', '责', '迮', '择', '帻', '啧', '舴', '笮', '箐', '赜', '折', '哲', '辄', '蛰', '谪', '摺', '磔', '辙'];  
e3 = ['扯', '偖', '撦', '苊',  '舸', '葛', '嗰', '禾', '纥', '合', '何', '和', '咊', '郃', '姀', '河', '盇', '狢', '峆', '饸', '阂', '籺', '荷', '核', '盍', '盉', '涸', '盒', '菏', '萂', '龁', '颌', '惒', '鲄', '貈', '鹖', '翮', '篕', '皬', '可', '坷', '渴', '喏', '惹', '舍', '也', '冶', '野', '者', '褚', '赭', '褶'];  
e4 = ['夨', '册', '冊', '侧', '厕', '测', '恻', '笧', '萗', '策', '憡', '簎', '屮', '彻', '迠', '坼', '烢', '聅', '硩', '掣', '撤', '澈', '徹', '瞮', '勶', '颚', '饿', '愕', '鹗', '噩', '恶', '垩', '鳄', '个', '各', '虼', '個', '铬', '硌', '箇', '贺', '褐', '赫', '鹤', '翯', '壑', '嚇', '鶮', '克', '刻', '客', '恪', '课', '溘', '乐', '勒', '讷', '热', '色', '涩', '啬', '铯', '瑟', '塞', '穑', '设', '社', '舍', '涉', '射', '赦', '慑', '摄', '歙', '忑', '忒', '特', '慝','业', '叶', '页', '邺', '夜', '曳', '拽', '咽', '烨', '晔', '掖', '液', '谒', '腋', '仄', '昃', '侧', '这', '柘', '浙', '蔗', '鹧'];  
  
i1 = ['屄', '皀', '逼', '毴', '楅', '豍', '螕', '鲾', '吃', '妛', '彨', '哧', '胵', '鸱', '蚩', '粚', '笞', '眵', '瓻', '喫', '嗤', '媸', '摛', '痴', '瞝', '魑', '癡', '攡', '呲', '玼', '疵', '偨', '髊', '氐', '仾', '低', '岻', '秖', '羝', '堤', '滴', '嘀', '镝', '鞮', '堆', '痽', '磓', '鐜', '几', '讥', '击', '饥', '圾', '机', '乩', '肌', '玑', '鸡', '矶', '姬', '屐', '积', '笄', '基', '嵇', '赍', '犄', '缉', '畸', '跻', '箕', '稽', '畿', '齑', '激', '羁', '哩', '咪', '眯', '妮', '丕', '批', '纰', '邳', '披', '砒', '劈', '七', '沏', '妻', '栖', '凄', '萋', '戚', '欺', '期', '漆', '蹊', '尸', '失', '师', '诗', '虱', '狮', '施', '湿', '丝', '司', '私', '咝', '思', '斯', '厮', '嘶', '撕', '剔', '踢', '梯', '夕', '兮', '吸', '汐', '西', '希', '析', '昔', '奚', '唏', '栖', '牺', '息', '悉', '硒', '欷', '惜', '烯', '淅', '溪', '犀', '晰', '皙', '翕', '稀', '锡', '熙', '僖', '熄', '晰', '膝', '嘻', '嬉', '熹', '螅', '羲', '蟋', '一', '伊', '衣', '医', '依', '咿', '铱', '揖', '漪', '之', '支', '只', '汁', '芝', '吱', '知', '肢', '织', '枝', '栀', '卮', '祗', '脂', '蜘', '孜', '吱', '甾', '兹', '姿', '咨', '资', '兹', '淄', '滋', '锱', '髭'];  
i2 = ['荸', '鼻', '弛', '驰', '池', '迟', '迡', '茌', '坻', '荎', '持', '匙', '筂', '墀', '漦', '遲', '踟', '词', '茈', '茨', '祠', '瓷', '辞', '慈', '鹚', '磁', '雌', '飺', '糍', '辤', '狄', '迪', '籴', '荻', '涤', '敌', '啇', '笛', '靮', '觌', '滌', '翟', '嫡', '蔋', '鸐', '及', '伋', '吉', '汲', '级', '极', '即', '亟', '急', '笈', '疾', '殛', '棘', '楫', '辑', '蒺', '嫉', '瘠', '厘', '骊', '猂', '离', '梨', '犁', '鹂', '蜊', '漓', '篱', '璃', '鲡', '罹', '棃', '漓', '弥', '祢', '迷', '谜', '醚', '糜', '麋', '蘼', '尼', '铌', '倪', '猊', '霓', '鲵', '泥', '皮', '枇', '毗', '疲', '啤', '琵', '脾', '罴', '貔', '羆', '祁', '齐', '岐', '奇', '其', '祈', '祇', '歧', '脐', '颀', '畦', '骑', '骐', '棋', '琦', '琪', '旗', '十', '石', '什', '时', '实', '食', '蚀', '埘', '提', '啼', '题', '鹈', '醍', '蹄', '习', '席', '袭', '媳', '隰', '檄', '仪', '夷', '诒', '宜', '怡', '姨', '贻', '咦', '胰', '移', '遗', '颐', '疑', '彝', '嶷', '执', '侄', '直', '值', '职', '殖', '植', '跖'];  
i3 = ['匕', '比', '朼', '夶', '吡', '妣', '沘', '佊', '疕', '彼', '毞', '柀', '秕', '笔', '粃', '舭', '俾', '啚', '鄙', '箄', '聛', '貏', '尺', '叺', '伬', '齿', '侈', '垑', '胣', '蚇', '耻', '恥', '豉', '袳', '欼', '裭', '此', '佌', '泚', '皉', '跐', '邸', '诋', '底', '抵', '砥', '聜', '鯳', '頧', '几', '己', '济', '挤', '脊', '戟', '礼', '李', '里', '俚', '理', '逦', '鲤', '米', '芈', '靡', '拟', '你', '逆', '昵', '匿', '腻', '愵', '溺', '嶷', '匹', '吡', '否', '痞', '癖', '乞', '企', '岂', '杞', '启', '起', '绮', '綮', '史', '矢', '豕', '使', '驶', '始', '屎', '死', '体', '洗', '玺', '徙', '喜', '屣', '乙', '己', '以', '钇', '矣', '苡', '蚁', '倚', '椅', '旖', '止', '只', '旨', '芷', '纸', '址', '祉', '枳', '咫', '指', '趾', '酯', '徵', '子', '仔', '姊', '籽', '耔', '秭', '茈', '梓', '紫', '訾', '滓'];  
i4 = ['币', '必', '毕', '闭', '庇', '佖', '诐', '芘', '邲', '坒', '怭', '怶', '苾', '妼', '泌', '陛', '毖' '柲', '珌', '毙', '狴', '婢', '敝', '愎', '弼', '裨', '辟', '蓖', '痹', '碧', '蔽', '弊', '箅', '壁', '避', '篦', '髀', '臂', '璧', '叱', '斥', '杘', '饬', '灻', '抶', '侙', '勅', '恜', '炽', '翅', '敕', '烾', '湁', '啻', '雴', '傺', '腟', '痸', '翤', '瘈', '遫', '憏', '瘛', '熾', '趩', '次', '伺', '佽', '刺', '刾', '疵', '茦', '栨', '赐', '蛓', '螆', '地', '坔', '杕', '旳', '弟', '的', '埅', '帝', '娣', '俤', '递', '埊', '焍', '谛', '菂', '第', '揥', '棣', '缔', '楴', '腣', '队', '对', '兊', '兑', '怼', '计', '记', '伎', '纪', '系', '忌', '际', '妓', '技', '剂', '季', '迹', '既', '荠', '济', '洎', '觊', '继', '绩', '悸', '祭', '偈', '寄', '寂', '蓟', '禝', '暨', '霁', '鲫', '稷', '冀', '髻', '骥', '力', '历', '厉', '立', '吏', '丽', '利', '吏', '沥', '枥', '例', '戾', '励', '隶', '俐', '荔', '郦', '栎', '猁', '栗', '莉', '莅', '砾', '砺', '粒', '笠', '唳', '痢', '溧', '汩', '泌', '宓', '觅', '秘', '密', '幂', '蜜', '屁', '辟', '睥', '僻', '璧', '气', '讫', '汽', '弃', '泣', '契', '砌', '器', '憩', '日', '士', '氏', '示', '市', '世', '仕', '似', '式', '事', '侍', '势', '试', '饰', '视', '柿', '是', '恃', '峙', '拭', '室', '适', '逝', '舐', '轼', '释', '弑', '谥', '巳', '四', '似', '寺', '汜', '姒', '兕', '祀', '驷', '饲', '泗', '俟', '耜', '肆', '嗣', '屉', '剃', '倜', '涕', '悌', '惕', '替', '嚏', '戏', '系', '细', '郄', '阋', '隙', '禊', '义', '亿', '弋', '刈', '艺', '忆', '议', '役', '异', '亦', '屹', '抑', '呓', '佚', '译', '邑', '易', '诣', '佾', '驿', '怿', '绎', '弈', '奕', '疫', '羿', '轶', '益', '谊', '挹', '悒', '逸', '翊', '翌', '溢', '缢', '意', '肄', '裔', '毅', '镒', '熠', '殪', '薏', '劓', '噫', '翳', '甏', '至', '豸', '志', '炙', '质', '治', '织', '制', '帜', '帙', '峙', '挚', '秩', '贽', '致', '窒', '痔', '鸷', '掷', '智', '痣', '彘', '置', '雉', '稚', '滞', '字', '自', '恣', '眦', '渍'];  
  
u1 = ['逋', '峬', '晡', '出', '初', '摴', '樗', '貙', '怚', '粗', '麄', '厾', '剢', '都', '阇', '督', '嗜', '夫', '伕', '呋', '肤', '柎', '荂', '麸', '趺', '跗', '稃', '鄜', '孵', '敷', '糐', '估', '杚', '姑', '沽', '泒', '孤', '苽', '咕', '呱', '轱', '鸪', '罛', '唂', '菰', '菇', '蛄', '笟', '辜', '酤', '毂', '箍', '乎', '匢', '芴', '呼', '忽', '昒', '恗', '惚', '唿', '滹', '刳', '枯', '哭', '窟', '撸', '噜', '模', '仆', '扑', '铺', '书', '殳', '抒', '纾', '叔', '枢', '姝', '倏', '殊', '梳', '菽', '淑', '疏', '舒', '输', '蔬', '苏', '酥', '凸', '秃', '突', '乌', '邬', '污', '呜', '巫', '屋', '诬', '钨', '朱', '邾', '侏', '诛', '茱', '诸', '珠', '株', '猪', '铢', '蛛', '租', '苴', '菹'];  
u2 = ['刍', '除', '芻', '厨', '蒢', '豠', '滁', '锄', '雏', '趎', '蒭', '蜍', '搊', '篨', '橱', '躇', '蹰', '徂', '殂', '独', '毒', '读', '渎', '牍', '椟', '裻', '黩', '巿', '弗', '凫', '伏', '甶', '孚', '芾', '芙', '扶', '拂', '绂', '绋', '苻', '帗', '服', '氟', '枹', '罘', '畉', '茯', '俘', '浮', '蚨', '袱', '虙', '艴', '符', '涪', '幅', '跗', '艀', '福', '蜉', '豧', '蝠', '鹘', '抇', '囫', '狐', '弧', '胡', '瓳', '壶', '隺', '斛', '焀', '鹄', '猢', '搰', '湖', '喖', '葫', '媩', '糊', '瑚', '鹘', '鹕', '蝴', '箶', '槲', '糊', '醐', '卢', '芦', '庐', '泸', '炉', '鸬', '颅', '母', '牡', '姆', '亩', '胟', '奴', '驽', '孥', '仆', '匍', '莆', '菩', '脯', '蔳', '璞', '濮', '如', '茹', '儒', '濡', '孺', '褚', '蠕', '孰', '赎', '塾', '俗', '图', '涂', '徒', '荼', '途', '涂', '屠', '无', '芜', '吾', '吴', '梧', '蜈', '竹', '竺', '烛', '逐', '躅', '足', '卒', '族', '镞'];  
u3 = ['卜', '卟', '补', '哺', '捕', '補', '杵', '础', '處', '椘', '榰', '储', '禇', '楚', '褚', '濋', '檚', '礎','笃', '堵', '赌', '睹', '覩', '甫', '抚', '拊', '府', '斧', '俛', '俯', '捬', '脯', '辅', '腑', '焤', '蜅', '腐', '頫', '黼', '夃', '古', '诂', '汩', '谷', '股', '牯', '骨', '羖', '贾', '罟', '蛄', '蛊', '鼓', '嘏', '榖', '瞽', '濲', '蠱', '虎', '浒', '汻', '俿', '唬', '琥', '苦', '卤', '虏', '掳', '鲁', '橹', '努', '弩', '朴', '浦', '圊', '普', '溥', '谱', '汝', '乳', '辱', '属', '黍', '鼠', '蜀', '数', '署', '薯', '曙', '土', '吐', '钍', '五', '午', '仵', '妩', '庑', '忤', '武', '侮', '捂', '鹉', '舞', '主', '拄', '渚', '煮', '嘱', '瞩', '阻', '组', '俎', '祖'] ;  
u4 = ['不', '布', '呸', '步', '怖', '钚', '部', '埔', '埠', '瓿', '蔀', '踄', '篰', '簿', '亍', '処', '处', '竌', '豖', '绌', '怵', '泏', '竐', '欪', '畜', '俶', '敊', '埱', '珿', '滀', '搐', '触', '閦', '黜', '斶', '觸', '矗', '促', '猝', '酢', '蔟', '趗', '醋', '憱', '踧', '噈', '瘯', '踿', '簇', '蹙', '蹴', '顣', '芏', '杜', '妒', '肚', '妬', '度', '荰', '秺', '靯', '渡', '镀', '螙', '蠧', '蟗', '讣', '父', '付', '妇', '负', '附', '咐', '驸', '坿', '竎', '阜', '赴', '复', '副', '富', '赋', '腹', '缚', '蝮', '馥', '覆', '固', '故', '顾', '凅', '牯', '梏', '崮', '崓', '雇', '锢', '鲴', '互', '弖', '户', '芐', '护', '沪', '帍', '戽', '岵', '怙', '枑', '祜', '怘', '笏', '瓠', '扈', '婟', '邿', '嫮', '滬', '鳠', '库', '绔', '裤', '喾', '酷', '陆', '录', '赂', '略', '逯', '鹿', '禄', '剹', '碌', '路', '箓', '戮', '辘', '潞', '鹭', '露', '木', '目', '沐', '苜', '牧', '募', '幕', '墓', '睦', '慕', '暮', '穆', '怒', '铺', '瀑', '曝', '入', '溽', '缛', '术', '戍', '束', '述', '树', '竖', '恕', '庶', '数', '墅', '漱', '夙', '诉', '肃', '速', '素', '宿', '谡', '粟', '愫', '塑', '嗉', '溯', '簌', '吐', '兔', '菟', '兀', '勿', '务', '戊', '芴', '物', '误', '恶', '悟', '晤', '骛', '雾', '寤', '伫', '助', '贮', '驻', '杼', '注', '祝', '柱', '炷', '蛀', '著', '铸', '箸', '筑'];  
  
v1 = ['且', '拘', '狙', '驹', '居', '掬', '据', '琚', '裾', '雎', '躹', '区', '曲', '驱', '岖', '屈', '祛', '躯', '趋', '蛐', '吁', '圩', '盱', '胥', '须', '戌', '虚', '需', '墟', '嘘',  '迂', '吁', '纡', '瘀', '淤'];  
v2 = ['局', '桔', '菊', '焗', '橘', '驴', '闾', '榈', '女', '劬', '渠', '瞿', '蘧', '衢', '徐', '予', '余', '妤', '盂', '臾', '鱼', '禺', '俞', '谀', '娱', '狳', '雩', '渔', '萸', '隅', '渝', '揄', '逾', '愉', '腴', '虞', '觎', '愚', '瑜', '榆', '舆', '蝓'];  
v3 = ['沮', '枸', '举', '莒', '矩', '龃', '踽', '吕', '侣', '捋', '旅', '偻', '铝', '屡', '缕', '膂', '褛', '履', '曲', '取', '娶', '龋', '许', '诩', '栩', '与', '予', '屿', '宇', '伛', '羽', '妪', '雨', '俣', '语', '禹', '圄', '圉', '瘐'];  
v4 = ['巨', '句', '苣', '拒', '炬', '具', '剧', '俱', '距', '据', '惧', '飓', '锯', '聚', '踞', '遽', '律', '虑', '绿', '率', '滤', '恧', '去', '觑', '趣', '旭', '序', '恤', '叙', '畜', '酗', '绪', '续', '勖', '婿', '絮', '蓄', '煦', '驭', '玉', '聿', '芋', '育', '狱', '昱', '浴', '峪', '预', '谕', '欲', '域', '寓', '喻', '御', '遇', '裕', '誉', '煜', '愈', '毓', '豫', '熨', '鹬'];  
  
ai1 = ['哀', '挨', '掰', '偲', '猜', '钗', '拆', '揣', '搋', '呆', '呔', '獃', '懛', '侅', '该', '陔', '郂', '荄', '垓', '乖', '摑', '嗨', '开', '揩', '拍', '塞', '腮', '鳃', '筛', '衰', '摔', '苔', '胎', '歪', '灾', '甾', '哉', '栽', '斋', '摘']  
ai2 = ['皑', '癌', '白', '才', '财', '材', '裁', '犲', '侪', '柴', '豺', '喍', '膗', '叏', '孩', '骸', '怀', '徊', '淮', '槐', '踝', '来', '埋', '霾', '排', '牌', '台', '苔', '抬', '宅', '翟'];  
ai3 = ['矮', '霭', '百', '佰', '柏', '捭', '摆', '毝', '采', '彩', '採', '睬', '踩', '茝', '揣', '歹', '歺', '逮', '傣', '忋', '改', '絠', '拐', '柺', '罫', '箉', '海', '胲', '烸', '酼', '醢', '凯', '恺', '铠', '慨', '剻', '买', '乃', '奶', '氖', '甩', '崴', '仔', '宰', '载', '崽', '窄'];  
ai4 = ['艾', '爱', '隘', '媛', '碍', '暧', '礙', '败', '拜', '猈', '稗', '粺', '薭', '菜', '蔡', '宷', '虿', '瘥', '袃', '揣', '踹', '膪', '啜', '代', '轪', '迨', '帒', '骀', '岱', '绐', '待', '贷', '带', '玳', '殆', '怠', '蚮', '袋', '跢', '黛', '戴', '丐', '乢', '匄', '芥', '钙', '盖', '溉', '戤', '概', '夬', '怪', '恠', '亥', '妎', '骇', '害', '氦', '坏', '忾', '块', '快', '侩', '哙', '筷', '赖', '癞', '籁', '睐', '迈', '麦', '卖', '脉', '奈', '柰', '耐', '鼐', '派', '塞', '赛', '晒', '帅', '率', '蟀', '太', '汰', '肽', '态', '钛', '泰', '酞', '外', '再', '在', '载', '债', '砦', '寨', '拽'];  
  
ei1 = ['陂', '卑', '杯', '柸', '背', '盃', '桮', '椑', '揹', '悲', '鹎', '碑', '藣', '鵯', '欸', '誒', '飞', '妃', '非', '菲', '啡', '婓', '婔', '绯', '扉', '暃', '蜚', '鲱', '霏', '馡', '黑', '嘿', '潶', '勒', '呸', '胚', '醅', '危', '威', '隈', '逶', '葳', '崴', '煨', '微', '巍'];  
ei2 = ['肥', '淝', '腓', '蜰', '雷', '傫', '缧', '擂', '镭', '羸', '没', '枚', '玫', '眉', '莓', '郿', '梅', '湄', '媒', '楣', '煤', '酶', '鹛', '霉', '陪', '赔', '裴', '谁', '为', '韦', '围', '圩', '闱', '违', '沩', '桅', '帷', '维', '唯', '嵬', '潍', '贼'];  
ei3 = ['北', '匪', '诽', '菲', '猆', '悱', '斐', '蜚', '翡', '榧', '篚', '给', '垒', '磊', '蕾', '儡', '每', '美', '镁', '馁', '伟', '伪', '苇', '尾', '续', '炜', '委', '玮', '娓', '诿', '隗', '萎', '猥', '痿', '鲔'];  
ei4 = ['贝', '钡', '狈', '孛', '邶', '苝', '备', '背', '钡', '被', '倍', '悖', '鄁', '琲', '惫', '棓', '辈', '焙', '蓓', '碚', '愂', '吠', '狒', '沸', '怫', '柿', '废', '肺', '费', '厞', '剕', '鼣', '濷', '肋', '泪', '类', '累', '妹', '沬', '袂', '昧', '寐', '媚', '魅', '内', '沛', '佩', '配', '辔', '卫', '为', '未', '位', '味', '胃', '畏', '谓', '尉', '喂', '猥', '蔚', '慰', '魏'];  
  
ui1 = ['吹', '炊', '龡','崔', '脺', '催', '缞', '慛', '獕', '摧', '归', '圭', '妫', '龟', '邽', '规', '茥', '闺', '皈', '胿', '珪', '硅', '椝', '瑰', '鲑', '灰', '灳', '炜', '诙', '咴', '挥', '拻', '洃', '袆', '虺', '珲', '晖', '豗', '堕', '婎', '辉', '睢', '麾', '徽', '隳', '亏', '悝', '盔', '窥', '谁', '虽', '瞧', '濉', '推', '隹', '追', '骓', '椎', '锥'];  
ui2 = ['垂', '隀', '揰', '搥', '棰', '椎', '圌', '锤', '槌', '笙', '顀', '回', '佪', '廻', '茴', '恛', '洄', '蚘', '烠', '痐', '蛔', '蛕', '奎', '隗', '逵', '揆', '葵', '魁', '睽', '夔', '蕤', '绥', '隋', '随', '遂', '髓', '颓'];  
ui3 = ['璀', '皠', '趡', '氿', '宄', '轨', '庋', '诡', '姽', '恑', '攱', '癸', '鬼', '祪', '晷', '湀', '蛫', '簋', '虺', '悔', '毁', '傀', '跬', '蕊', '水', '髓', '腿', '觜', '嘴'];  
ui4 = ['脆', '倅', '萃', '啐', '淬', '悴', '焠', '瘁', '翠', '粹', '膬', '竁', '襊', '濢', '攰', '昋', '刿', '刽', '炅', '炔', '柜', '贵', '桂', '桧', '椢', '猤', '筀', '跪', '瞆', '螝', '鳜', '卉', '屶', '屷', '汇', '讳', '会', '泋', '浍', '绘', '哕', '诲', '荟', '芔', '贿', '烩', '桧', '恚', '晦', '彗', '秽', '惠', '喙', '阓', '慧', '匮', '馈', '溃', '愧', '聩', '芮', '锐', '蚋', '睿', '瑞', '税', '睡', '说', '岁', '祟', '遂', '碎', '隧', '穗', '燧', '邃', '退', '蜕', '褪', '坠', '缀', '缒', '惴', '赘', '最', '罪', '醉'];  
  
ao1 = ['凹', '柪', '梎', '包', '苞', '孢', '枹', '胞', '剥', '笣', '龅', '褒', '杓', '标', '飑', '彪', '淲', '猋', '摽', '骠', '镖', '飙', '飚', '操', '糙', '抄', '怊', '欩', '钞', '超', '焯', '刀', '叨', '忉', '氘', '舠', '鱽', '刁', '叼', '汈', '刟', '虭', '凋', '貂', '碉', '鲷', '雕', '羔', '皋', '高', '膏', '糕', '睾', '篙', '鼛', '鷎', '茠', '蒿', '薅', '薧', '交', '郊', '茭', '骄', '娇', '姣', '浇', '胶', '教', '焦', '椒', '蛟', '跤', '鲛', '蕉', '礁', '尻', '捞', '撩', '猫', '喵', '孬', '抛', '泡', '剽', '嘌', '漂', '缥', '飘', '悄', '硗', '跷', '敲', '锹', '橇', '娆', '搔', '骚', '缫', '捎', '烧', '梢', '稍', '蛸', '艄', '鞘', '叨', '涛', '绦', '焘', '滔', '韬', '佻', '挑', '祧', '肖', '枭', '哓', '削', '骁', '绡', '宵', '逍', '销', '硝', '蛸', '箫', '潇', '霄', '魈', '幺', '天', '吆', '妖', '腰', '遭', '糟', '钊', '招', '昭', '着', '啁', '朝'];  
ao2 = ['敖', '隞', '蔜', '遨','獓', '熬','獒','螯', '翱', '鳌', '嚣','鏖', '鷔','雹', '薄', '嫑', '曹', '嘈', '漕', '槽','牊', '晁', '巢', '朝', '鼌', '漅', '潮', '樔', '嘲', '捯', '毜', '蚝', '毫', '椃', '獆', '貉', '豪', '嗥', '濠', '壕', '嚎', '蠔', '籇', '矫', '嚼', '劳', '牢', '涝', '崂', '痨', '潦', '醪', '辽', '疗', '聊', '僚', '寥', '潦', '缭', '鹩', '髎', '毛', '矛', '茅', '旄', '锚', '楙', '髦', '牦', '蟊', '苗', '描', '瞄', '挠', '蛲', '铙', '刨', '庖', '袍', '嫖', '瓢', '乔', '侨', '荞', '桥', '谯', '憔', '樵', '瞧', '饶', '勺', '芍', '苕', '韶', '洮', '逃', '陶', '桃', '淘', '萄', '啕', '条', '苕', '迢', '调', '髫', '崤', '爻', '尧', '肴', '姚', '窑', '摇', '谣', '徭', '遥', '瑶', '凿', '着'];  
ao3 = ['袄', '媪','宝', '饱', '怉', '鸨', '保', '葆', '堡', '堢', '媬', '褓', '寳', '表', '婧', '裱', '褾', '艸', '草', '愺', '懆', '吵', '炒', '眧', '焣', '煼', '导', '岛', '陦', '捣', '倒', '褥', '裯', '蹈', '扚', '屌', '夰', '杲', '搞', '缟', '槁', '暠', '稿', '镐', '檺', '好', '郝', '角', '侥', '佼', '狡', '饺', '绞', '皎', '脚', '矫', '搅', '剿', '缴', '考', '拷', '烤', '老', '佬', '姥', '了', '瞭', '燎', '卯', '昴', '铆', '秒', '眇', '渺', '缈', '淼', '藐', '邈', '恼', '脑', '鸟', '袅', '嬲', '跑', '殍', '巧', '扰', '扫', '嫂', '少', '讨', '窕', '挑', '小', '晓', '杳', '咬', '窈', '舀', '早', '枣', '蚤', '澡', '藻', '爪', '找', '沼'];  
ao4 = ['拗', '岰', '傲', '奥', '骜', '嫯', '慠', '懊', '墺', '澳', '鏊', '鷔','勽', '刨', '报', '抱', '铇', '豹', '趵','蚫','菢', '鲍', '骲','髱', '暴', '爆', '曝', '俵', '摽', '鳔', '肏', '鄵', '襙', '鼜', '仦', '仯', '耖', '觘', '到', '倒', '帱', '悼', '焘', '菿', '盗', '道', '翢', '稻', '艔', '檤', '弔', '吊', '钓', '窎', '调', '掉', '藋', '告', '郜', '勂', '诰', '峼', '祮', '号', '昊', '昦', '侴', '秏', '悎', '耗', '哠', '浩', '恏', '晧', '傐', '皓', '鄗', '聕', '滈', '暤', '皜', '澔', '镐', '颢', '灏', '叫', '觉', '较', '教', '窖', '酵', '徼', '醮', '铐', '犒', '靠', '涝', '唠', '烙', '嗠', '酷', '嫪', '料', '廖', '撂', '镣', '茂', '冒', '贸', '袤', '帽', '瑁', '貌', '懋', '妙', '庙', '缪', '闹', '淖', '尿', '泡', '炮', '疱', '票', '骠', '漂', '壳', '俏', '诮', '峭', '窍', '翘', '撬', '鞘', '绕', '扫', '燥', '臊', '邵', '绍', '哨', '套', '眺', '粜', '跳', '孝', '肖', '哮', '笑', '校', '效', '啸', '要', '药', '钥', '曜', '耀', '灶', '皂', '造', '噪', '燥', '躁', '兆', '诏', '赵', '棹', '罩', '照', '肇'];  
  
ou1 = ['抽', '紬', '搊', '篘', '瘳', '吺', '剅', '兜', '蔸', '篼', '勾', '沟', '佝', '枸', '钩', '痀', '袧', '缑', '篝', '鞲', '齁', '抠', '搂', '哞', '讴', '沤', '欧', '殴', '瓯', '鸥', '剖', '娝', '收', '叟', '搜', '嗖', '溲', '艘', '偷', '优', '忧', '攸', '呦', '幽', '悠', '州', '舟', '谄', '周', '洲', '啁', '粥', '邹', '驺', '陬', '诹', '鲰'];  
ou2 = ['仇', '俦', '帱', '栦', '菗', '绸', '惆', '畴', '愁', '稠', '筹', '酬', '酧', '裯', '踌', '雔', '唞', '紑', '侯', '矦', '葔', '喉', '猴', '篌', '骺', '翭', '娄', '偻', '楼', '蝼', '牟', '谋', '眸', '鍪', '羺', '抔', '柔', '揉', '蹂', '熟', '头', '投', '骰', '尤', '由', '邮', '犹', '油', '疣', '柚', '莸', '铀', '蚰', '鱿', '蝣', '妯', '轴'];  
ou3 = ['丑', '吜', '杻', '杽', '瞅', '醜', '矁', '斗', '阧', '抖', '陡', '蚪', '缶', '否', '妚', '缻', '缹', '雬', '殕', '芶', '苟', '狗', '岣', '耈', '枸', '玽', '蚼', '笱', '豿', '吼', '犼', '搂', '篓', '某', '呕', '偶', '耦', '藕', '掊', '手', '首', '守', '叟', '瞍', '薮', '擞', '友', '有', '酉', '莠', '牖', '黝', '肘', '帚', '走'];  
ou4 = ['臭', '臰', '遚', '殠', '凑', '辏', '榛', '腠', '豆', '逗', '渎', '酘', '脰', '痘', '閗', '窦', '诟', '坸', '购', '构', '姤', '垢', '冓', '够', '啂', '雊', '彀', '媾', '煹', '觏', '后', '郈', '厚', '茩', '逅', '堠', '豞', '鲎', '鲘', '叩', '扣', '寇', '蔲', '陋', '漏', '镂', '瘘', '露', '耨', '獳', '沤', '怄', '肉', '寿', '受', '狩', '兽', '售', '授', '绶', '瘦', '嗽', '透', '又', '右', '幼', '佑', '侑', '囿', '柚', '宥', '诱', '釉', '鼬', '纣', '咒', '宙', '胄', '昼', '皱', '骤', '繇', '籀', '奏', '揍'];  
  
iu1 = ['丢', '铥', '颩', '纠', '鸠', '究', '赳', '阄', '啾', '揪', '溜', '蹓', '熘', '妞', '丘', '邱', '秋', '蚯', '湫', '鳅', '休', '修', '咻', '羞', '馐'];  
iu2 = ['刘', '浏', '流', '留', '琉', '硫', '骝', '榴', '瘤', '牛', '囚', '虬', '求', '泅', '酋', '逑', '球', '遒', '裘'];  
iu3 = ['九', '久', '灸', '韭', '酒', '柳', '绺', '锍', '狃', '扭', '钮', '糗', '朽', '宿'];  
iu4 = ['旧', '臼', '疚', '咎', '柩', '救', '就', '舅', '鹫', '六', '溜', '鹨', '谬', '缪', '拗', '秀', '岫', '绣', '袖', '锈', '嗅'];  
  
ie1 = ['憋', '瘪', '蟞', '鳖', '爹', '跌', '褺', '阶', '疖', '皆', '接', '揭', '街', '揭', '嗟', '咩', '捏', '撇', '暼', '瞥', '切', '贴', '帖', '些', '楔', '歇', '蝎'];  
ie2 = ['别', '莂', '蛂', '徶', '蹩', '苵', '迭', '咥', '峌', '挕', '绖', '垤', '昳', '瓞', '眣', '耋', '谍', '眰', '趎', '跕', '畳', '喋', '惵', '叠', '牃', '碟', '殜', '蝶', '螲', '节', '劫', '杰', '诘', '狤', '洁', '拮', '桀', '婕', '捷', '颉', '截', '碣', '竭', '羯', '伽', '茄', '邪', '协', '胁', '挟', '斜', '谐', '携', '撷'];  
ie3 = ['瘪', '姐', '解', '撇', '且', '铁', '写', '血'];  
ie4 = ['彆', '哋', '介', '芥', '戒', '届', '玠', '疥', '界', '诫', '借', '列', '劣', '冽', '洌', '烈', '烮', '猎', '裂', '灭', '蔑', '篾', '乜', '涅', '聂', '臬', '镊', '镍', '蹑', '孽', '切', '妾', '怯', '窃', '挈', '惬', '趄', '慊', '锲', '箧', '餮', '泄', '绁', '泻', '卸', '屑', '械', '亵', '谢', '解', '榭', '獬', '懈', '邂', '蟹', '瀣', '燮'];  
  
ve1 = ['噘', '撅', '炔', '缺', '削', '靴', '薛', '曰', '约'];  
ve2 = ['决', '诀', '抉', '绝', '觉', '倔', '厥', '爵', '蹶', '瘸', '穴', '学'];  
ve3 = ['雪', '鳕', '哕'];  
ve4 = ['略', '掠', '疟', '虐', '却', '雀', '确', '阕', '阙', '鹊', '榷', '谑', '月', '乐', '刖', '岳', '栎', '钥', '铖', '阅', '悦', '跃', '越', '粤'];  
  
er1 = ['乻'];  
er2 = ['儿', '而', '児', '栭', '胹', '鸸', '鲕'];  
er3 = ['尔', '尒', '耳', '迩', '饵', '洱', '毦', '栮', '珥', '铒'];  
er4 = ['二', '弍', '贰', '髶', '樲'];  
  
an1 = ['安', '氨', '庵', '谙', '萻', '鹌', '鞍', '偣', '扳', '朌', '攽', '班', '般', '颁', '斑', '搬', '螌', '边', '笾', '编', '鞭', '鳊', '鞭', '参', '骖', '湌', '喰', '傪', '餐', '觇', '掺', '搀', '裧', '幨', '襜', '巛', '川', '氚', '穿', '瑏', '汆', '撺', '蹿', '丹', '妉', '担', '单', '耽', '郸', '聃', '躭', '酖', '殚', '瘅', '箪', '儋', '擔', '敁', '掂', '厧', '嵮', '滇', '颠', '巅', '癫', '耑', '端', '媏', '褍', '帆', '忛', '番', '蕃', '嬏', '旙', '翻', '藩', '籓', '干', '甘', '杆', '肝', '玕', '姏', '泔', '苷', '坩', '竿', '柑', '酐', '疳', '粓', '尴', '尲', '关', '观', '纶', '官', '冠', '倌', '棺', '鳏',  '蚶', '酣', '憨', '馠', '鼾', '欢', '犿', '狟', '嚾', '獾', '懽', '貛', '尖', '戋', '奸', '间', '歼', '坚', '肩', '艰', '兼', '监', '菅', '蒹', '煎', '鲣', '鹣', '娟', '捐', '涓', '鹃', '刊', '龛', '勘', '堪', '戡', '宽', '髋', '囝', '囡', '拈', '蔫', '潘', '攀', '偏', '翩', '篇', '千', '阡', '芊', '迁', '钎', '牵', '悭', '铅', '谦', '愆', '骞', '搴', '悛', '圈', '三', '山', '删', '杉', '衫', '姗', '舢', '栅', '珊', '扇', '煽', '潸', '膻', '闩', '拴', '栓', '狻', '酸', '贪', '滩', '瘫', '天', '添', '湍', '弯', '剜', '湾', '蜿', '豌', '仙', '纤', '先', '氙', '掀', '鲜', '暹', '轩', '宣', '谖', '萱', '喧', '咽', '烟', '胭', '焉', '淹', '阉', '腌', '嫣', '燕', '鸢', '冤', '鸳', '渊', '簪', '糌', '专', '砖', '颛', '钻', '躜', '占', '沾', '毡', '旃', '粘', '詹', '瞻'];  
an2 = ['儑', '残', '蚕', '惭', '苂', '谗', '婵', '馋', '湹', '孱', '棎', '禅', '煘', '缠', '蝉', '潺', '潹', '澶', '蟾', '传', '舡', '舩', '船', '剶', '遄', '椽', '傳', '暷', '篅', '菆', '攒', '櫕', '巑', '欑', '穳', '凡', '匥', '杋', '钒', '矾', '籵', '舤', '烦', '笲', '棥', '繁', '樊', '燔', '羳', '蹯', '蘩', '邗', '邯', '含', '函', '焓', '晗', '琀', '涵', '崡', '崴', '寒', '韩', '筨', '还', '郇', '环', '荁', '峘', '洹', '桓', '萑', '萑', '獂', '羦', '寰', '嬛', '阛', '鹮', '煨', '鬟', '兰', '岚', '拦', '栏', '婪', '阑', '蓝', '澜', '篮', '连', '奁', '怜', '帘', '涟', '莲', '裢', '联', '廉', '鲢', '娈', '峦', '孪', '栾', '鸾', '脔', '銮', '蛮', '馒', '瞒', '鳗', '眠', '绵', '棉', '男', '南', '难', '喃', '楠', '年', '粘', '鲇', '黏', '奻', '盘', '磐', '蹒', '蟠', '骈', '胼', '前', '钱', '虔', '乾', '潜', '黔', '全', '权', '诠', '荃', '泉', '拳', '痊', '筌', '蜷', '醛', '颧', '然', '髯', '燃', '坛', '昙', '郯', '谈', '弹', '覃', '痰', '谭', '澹', '檀', '田', '恬', '畋', '甜', '阗', '团', '抟', '丸', '纨', '完', '玩', '顽', '烷', '闲', '弦', '贤', '咸', '娴', '衔', '舷', '嫌', '玄', '悬', '旋', '漩', '璇', '延', '妍', '严', '言', '岩', '沿', '炎', '妍', '研', '盐', '阎', '蜒', '筵', '颜', '檐', '元', '沅', '园', '员', '芫', '垣', '爰', '袁', '圆', '原', '媛', '援', '鼋', '缘', '源', '猿', '辕', '螈', '咱'];  
an3 = ['俺', '埯', '晻', '罯', '阪', '岅', '板', '坂', '版', '昄', '闆', '贬', '扁', '匾', '褊', '惨', '憯', '黪', '产', '刬', '旵', '丳', '斺', '浐', '谄', '阐', '铲', '舛', '喘', '僢', '踳', '瓭', '胆', '疸', '掸', '亶', '玬', '典', '点', '奌', '碘', '蒧', '短', '反', '払', '仮', '返', '橎', '杆', '秆', '赶', '笴', '桿', '敢', '感', '澉', '橄', '澸', '擀', '鳡', '莞', '馆', '筦', '管', '罕', '浫', '喊', '蔊', '豃', '缓', '睆', '囝', '拣', '俭', '茧', '柬', '捡', '减', '剪', '检', '锏', '简', '戬', '碱', '翦', '蹇', '卷', '坎', '侃', '砍', '槛', '款', '览', '揽', '缆', '榄', '懒', '敛', '琏', '脸', '卵', '满', '螨', '丐', '免', '勉', '眄', '渑', '冕', '缅', '腼', '郝', '捻', '辗', '暖', '浅', '遗', '谴', '缱', '犬', '绻', '冉', '苒', '染', '阮', '软', '伞', '散', '闪', '陕', '忐', '坦', '毯', '忝', '殄', '腆', '舔', '疃', '宛', '莞', '挽', '绾', '惋', '婉', '脘', '晚', '晚', '琬', '皖', '碗', '险', '冼', '显', '猃', '铣', '跣', '藓', '选', '癣', '奄', '兖', '俨', '衍', '剡', '眼', '偃', '郾', '琰', '演', '远', '昝', '攒', '趱', '斩', '盏', '展', '崭', '搌', '辗', '转', '缵', '纂'];  
an4 = ['犴', '岸', '按', '胺', '案', '豻', '隌', '暗', '闇', '黯','办', '半', '伴', '扮', '拌', '姅', '绊', '坢', '柈', '秚', '靽', '辦', '瓣', '卞', '弁', '汴', '忭', '变', '昪', '便', '辨', '辩', '辫', '灿', '孱', '粲', '澯', '燦', '璨', '忏', '刬', '硟', '懴', '颤', '羼', '串', '钏', '猭', '窜', '殩', '熶', '篡', '竄', '旦', '但', '诞', '狚', '担', '泹', '沊', '蛋', '惮', '啖', '啗', '弹', '淡', '萏', '氮', '腅', '觛', '电', '甸', '阽', '佃', '店', '坫', '垫', '扂', '玷', '钿', '惦', '淀', '琔', '奠', '殿', '靛', '簟', '驔', '段', '断', '葮', '缎', '塅', '煅', '瑖', '锻', '簖', '犯', '饭', '泛', '贩', '范', '畈', '梵', '干', '汵', '旰', '盰', '绀', '倝', '淦', '骭', '赣', '灨', '卝', '毌', '丱', '观', '贯', '泴', '掼', '涫', '惯', '盥', '雚', '灌', '瓘', '鹳', '罐', '厈', '汉', '汗', '屽', '闬', '旱', '悍', '唅', '猂', '莟', '捍', '菡', '焊', '皔', '晗', '颔', '蜭', '憾', '翰', '撼', '瀚', '幻', '肒', '奂', '宦', '唤', '换', '涣', '浣', '焕', '梙', '逭', '患', '嵈', '痪', '豢', '鲩', '擐', '鰀', '见', '件', '间', '建', '饯', '贱', '荐', '剑', '舰', '健', '涧', '渐', '谏', '毽', '腱', '践', '溅', '鉴', '键', '槛', '僭', '箭', '卷', '倦', '隽', '眷', '看', '瞰', '烂', '滥', '练', '炼', '恋', '殓', '链', '潋', '乱', '曼', '谩', '幔', '蔓', '漫', '慢', '面', '难', '廿', '念', '判', '泮', '盼', '叛', '畔', '袢', '片', '骗', '欠', '纤', '茜', '倩', '堑', '嵌', '歉', '劝', '券', '散', '讪', '钐', '汕', '扇', '善', '禅', '缮', '擅', '膳', '赡', '蟮', '鳝', '涮', '蒜', '算', '叹', '炭', '探', '碳', '彖', '万', '腕', '县', '苋', '岘', '限', '现', '线', '宪', '陷', '馅', '羡', '腺', '献', '霰', '炫', '绚', '眩', '渲', '厌', '砚', '咽', '彦', '唁', '验', '宴', '艳', '晏', '谚', '焰', '焱', '堰', '雁', '滟', '燕', '苑', '院', '怨', '掾', '愿', '暂', '赞', '瓒', '占', '战', '栈', '站', '绽', '湛', '传', '转', '赚', '馔', '撰', '篆', '钻', '赚', '攥'];  
  
en1 = ['奔', '泍', '贲', '锛', '参', '嵾', '抻', '郴', '捵', '棽', '琛', '嗔', '奀', '恩', '蒽', '煾', '分', '芬', '帉', '吩', '纷', '氛', '玢', '翂', '躮', '酚', '雰', '馚', '根', '跟', '闷', '喷', '森', '申', '伸', '身', '参', '呻', '绅', '娠', '莘', '砷', '深', '温', '瘟', '贞', '针', '侦', '帧', '浈', '胗', '珍', '桢', '真', '砧', '斟', '溱', '甄', '祯', '榛', '箴', '臻'];  
en2 = ['岑', '涔', '埁', '笒', '梣', '尘', '臣', '辰', '忱', '沉', '陈', '茝', '莀', '莐', '宸', '桭', '谌', '晨', '愖', '煁', '塵', '瘎', '霃', '妢', '岎', '汾', '坟', '炃', '朌', '枌', '羒', '蚠', '蚡', '焚', '棼', '鼢', '哏', '拫', '痕', '鞎', '门', '们', '扪', '盆', '人', '仁', '壬', '任', '神', '什', '文', '纹', '蚊', '雯'];  
en3 = ['本', '苯', '奙', '翉', '畚', '榀', '趻', '硶', '碜', '夦', '峎', '粉', '黺', '艮', '很', '狠', '佷', '肯', '恳', '啃', '忍', '荏', '稔', '沈', '审', '哂', '矧', '谂', '婶', '刎', '吻', '紊', '稳', '怎', '诊', '枕', '轸', '胗', '疹', '畛', '缜', '稹'];  
en4 = ['夯', '坌', '逩', '倴', '桳', '笨', '渀', '衬', '疢', '称', '龀', '趁', '趂', '榇', '谶', '嚫', '儭', '扽', '摁', '份', '弅', '鳱', '忿', '奋', '秎', '偾', '粪', '愤', '亘', '艮', '茛', '搄', '恨', '闷', '焖', '懑', '恁', '嬾', '喯', '刃', '认', '仞', '任', '纫', '妊', '韧', '衽', '葚', '肾', '甚', '渗', '慎', '椹', '蜃', '问', '汶', '谮', '阵', '圳', '鸩', '振', '朕', '赈', '镇', '震'];  
  
in1 = ['邠', '宾', '彬', '梹', '椕', '斌', '滨', '缤', '槟', '瑸', '镔', '濒', '豳', '豩', '虨', '巾', '今', '斤', '金', '矜', '津', '筋', '襟', '拎', '拼', '姘', '侵', '亲', '钦', '衾', '心', '辛', '芯', '莘', '锌', '歆', '薪', '馨', '鑫', '因', '阴', '茵', '姻', '音', '氤', '殷', '喑'];  
in2 = ['邻', '聆', '阾', '林', '临', '淋', '琳', '霖', '磷', '鳞', '麟', '民', '岷', '旻', '您', '贫', '玭', '频', '芹', '芩', '秦', '禽', '琴', '勤', '擒', '噙', '吟', '垠', '银', '淫', '寅', '龈', '霪'];  
in3 = ['仅', '紧', '堇', '谨', '锦', '凛', '懔', '廪', '皿', '闵', '抿', '泯', '闽', '悯', '敏', '愍', '品', '寝', '引', '尹', '饮', '蚓', '吲', '隐', '瘾'];  
in4 = ['摈', '殡', '膑', '鬂', '髌', '鬓', '尽', '劲', '进', '近', '浸', '烬', '晋', '禁', '吝', '赁', '蔺', '躏', '牝', '聘', '沁', '揿', '囟', '芯', '信', '衅', '印', '荫', '胤', '窨'];  
  
un1 = ['旾', '杶', '春', '媋', '堾', '椿', '槆', '暙', '瑃', '暙', '箺', '鰆', '邨', '村', '皴', '踆', '澊', '竴', '吨', '惇', '敦', '蜳', '墩', '镦', '礅', '蹲', '蹾', '衮', '绲', '惃', '辊', '滚', '鲧', '磙', '鮌', '昏', '荤', '阍', '婚', '涽', '坤', '昆', '堃', '崐', '髡', '鹍', '抡', '孙', '狲', '飧', '吞', '谆', '尊', '遵', '樽', '鳟'];  
un2 = ['纯', '陙', '莼', '唇', '浱', '脣', '淳', '鹑', '滣', '醇', '存', '侟', '拵', '忶', '浑', '珲', '混', '馄', '魂', '仑', '伦', '沦', '纶', '囮', '黁', '屯', '囤', '豚', '臀'];  
un3 = ['偆', '惷', '睶', '蠢', '刌', '忖', '盹', '趸', '躉', '圂', '溷', '诨', '俒', '捆', '吮', '笋', '损', '隼', '氽', '准', '撙'];  
un4 = ['寸', '伅', '庉', '沌', '囤', '炖', '逇', '钝', '盾', '顿', '遁', '楯', '燉', '踲', '棍', '睔', '倱', '婫', '混', '困', '论', '闰', '润', '顺', '舜', '瞬'];  
  
vn1 = ['军', '君', '均', '钧', '菌', '逡', '勋', '埚', '熏', '曛', '晕', '熳', '氲'];  
vn2 = ['裙', '群', '麇', '巡', '寻', '旬', '荨', '洵', '峋', '恂', '循', '鲟', '匀', '云', '芸', '纭', '筠'];  
vn3 = ['允', '狁', '陨', '殒'];  
vn4 = ['郡', '俊', '骏', '浚', '隽', '竣', '濬', '讯', '训', '迅', '驯', '汛', '逊', '巽', '殉', '浚', '孕', '运', '郓', '恽', '晕', '酝', '愠', '韵', '熨', '蕴'];  
  
ang1 = ['肮', '骯', '帮', '邦', '垹', '梆', '浜', '捠', '崩', '绷', '痭', '嵭', '仓', '苍', '沧', '鸧', '舱', '伥', '昌', '倡', '菖', '娼', '猖', '淐', '琩', '锠', '裮', '鲳', '鼚', '疮', '窗', '牎', '摐', '当', '珰', '裆', '铛', '方', '芳', '汸', '坊', '枋', '冈', '冮', '刚', '纲', '岗', '肛', '疘', '矼', '牨', '钢', '缸', '罡', '光', '灮', '炗', '炚', '炛', '茪', '咣', '姯', '烡', '桄', '胱', '僙', '黆', '夯', '巟', '肓', '荒', '宺', '朚', '慌', '塃', '江', '将', '姜', '浆', '豇', '僵', '缰', '疆', '康', '慷', '糠', '匡', '诓', '筐', '牤', '邙', '囔', '乓', '滂', '羌', '枪', '戗', '跄', '腔', '锵', '嚷', '丧', '桑', '伤', '殇', '商', '觞', '墒', '熵', '双', '泷', '霜', '孀', '汤', '趟', '镗', '汪', '乡', '相', '香', '厢', '湘', '箱', '襄', '骧', '镶', '央', '泱', '殃', '秧', '鸯', '鞅', '赃', '脏', '臧', '张', '章', '鄣', '獐', '彰', '漳', '樟', '璋', '蟑', '庄', '妆', '桩', '装'];  
ang2 = ['卬', '昂', '甭', '藏', '臧', '长', '仧', '仩', '场', '肠', '苌', '尝', '偿', '徜', '常', '裳', '嫦', '瑺', '床', '牀', '幢', '噇', '防', '妨', '房', '肪', '鲂', '坊', '行', '迒', '杭', '绗', '桁', '珩', '蚢', '航', '笐', '颃', '裄', '皇', '隍', '凰', '偟', '黄', '徨', '遑', '媓', '惶', '煌', '瑝', '潢', '獚', '熿', '蝗', '璜', '艎', '篁', '穔', '磺', '蟥', '簧', '鳇', '趪', '鷬', '扛', '狂', '诳', '郎', '狼', '桹', '廊', '琅', '稂', '锒', '螂', '良', '凉', '梁', '量', '粮', '粱', '芒', '忙', '尨', '氓', '盲', '笀', '茫', '囊', '娘', '彷', '庞', '旁', '徬', '螃', '鳑', '强', '嫱', '墙', '樯', '穰', '瓤', '唐', '堂', '棠', '塘', '膛', '糖', '镗', '螳', '亡', '王', '降', '详', '祥', '翔', '阳', '扬', '羊', '杨', '炀', '疡', '佯', '洋'];  
ang3 = ['绑', '榜', '牓', '膀', '埄', '埲', '菶', '琫', '琣', '鞛', '厂', '场', '昶', '敞', '氅', '闯', '傸', '挡', '党', '谠', '访', '仿', '纺', '昉', '眆', '舫', '岗', '港', '广', '広', '犷', '臩', '怳', '恍', '炾', '晃', '晄', '谎', '奛', '慌', '幌', '熀', '櫎', '讲', '奖', '桨', '蒋', '夼', '朗', '两', '俩', '魉', '莽', '蟒', '馕', '抢', '羟', '壤', '嚷', '嗓', '晌', '赏', '爽', '倘', '淌', '傥', '躺', '网', '往', '罔', '枉', '惘', '辋', '魍', '享', '响', '饷', '想', '仰', '养', '氧', '痒', '长', '涨', '掌'];  
ang4 = ['枊', '盎', '醠', '玤', '蚌', '棒', '棓', '傍', '谤', '蒡', '搒', '塝', '稖', '迸', '泵', '蚌', '揼', '塴', '蹦', '镚', '賶', '怅', '玚', '畅', '倡', '唱', '焻', '创', '怆', '刱', '剙', '氹', '宕', '砀', '荡', '档', '逷', '嵣', '放', '杠', '筻', '槓', '戆', '俇', '逛', '臦', '沆', '晃', '滉', '愰', '蟥', '皝', '皩', '匠', '降', '绛', '酱', '犟', '糨', '亢', '伉', '抗', '炕', '邝', '况', '旷', '矿', '框', '眶', '阆', '浪', '亮', '谅', '晾', '靓', '踉', '辆', '齉', '酿', '胖', '呛', '跄', '让', '丧', '上', '尚', '绱', '烫', '趟', '妄', '忘', '旺', '望', '向', '相', '象', '像', '橡', '巷', '怏', '恙', '烊', '样', '漾', '葬', '藏', '丈', '仗', '帐', '杖', '胀', '账', '障', '嶂', '瘴', '壮', '状', '奘', '僮', '幢', '撞'];  
  
eng1 = ['噌', '阷', '泟', '爯', '怪', '棦', '称', '秤', '浾', '琤', '碀', '蛏', '赪', '靗', '憆', '撑', '噌', '樘', '瞠', '灯', '登', '噔', '璒', '蹬', '簦', '竳', '鞥', '丰', '风', '凨', '仹', '枫', '疯', '砜', '封', '峰', '桻', '堼', '崶', '锋', '蜂', '篈', '鄷', '更', '刯', '庚', '畊', '耕', '浭', '赓', '焿', '鹒', '羹', '亨', '哼', '脝', '涥', '悙', '吭', '坑', '铿', '蒙', '抨', '怦', '砰', '烹', '嘭', '扔', '僧', '升', '生', '声', '牲', '笙', '甥', '翁', '嗡', '曾', '增', '缯', '憎', '罾', '正', '争', '诤', '征', '怔', '政', '挣', '狰', '峥', '钲', '症', '睁', '铮', '筝', '蒸', '鲭'];  
eng2 = ['层', '曾', '嶒', '層', '竲', '丞', '成', '朾', '呈', '诚', '枨', '承', '荿', '宬', '娍', '峸', '洆', '城', '埕', '珹', '程', '铖', '揨', '筬', '惩', '塍', '塖', '溗', '酲', '澄', '澂', '憕', '橙', '檙', '懲', '冯', '沨', '逢', '缝', '摓', '恒', '姮', '珩', '胻', '烆', '桁', '鸻', '撗', '横', '衡', '蘅', '棱', '尨', '虻', '萌', '蒙', '盟', '濛', '鹲', '能', '朋', '彭', '棚', '蓬', '鹏', '澎', '篷', '仍', '绳', '疼', '腾', '滕', '藤'];  
eng3 = ['逞', '骋', '悜', '等', '戥', '讽', '唪', '郠', '莄', '哽', '梗', '峺', '绠', '耿', '鲠', '骾', '冷', '猛', '锰', '蜢', '捧', '省', '眚', '拯', '整'];  
eng4 = ['蹭', '称', '秤', '牚', '邓', '隥', '凳', '墱', '瞪', '凤', '奉', '傣', '葑', '湗', '焨', '更', '堩', '暅', '啈', '横', '愣', '楞', '孟', '梦', '碰', '艿', '圣', '胜', '晟', '乘', '剩', '盛', '瓮', '锃', '缯', '赠', '甑', '正', '证', '郑', '怔', '政', '症', '铮'];  
  
ing1 = ['仌', '并', '冰', '兵', '栟', '掤', '槟', '丁', '仃', '叮', '玎', '钉', '盯', '疔', '町', '虰', '耵', '酊', '靪', '泾', '京', '茎', '径', '经', '荆', '旌', '菁', '稉', '晶', '晴', '粳', '兢', '鲸', '乒', '娉', '青', '轻', '氢', '卿', '倾', '清', '蜻', '鲭', '厅', '汀', '町', '听', '烃', '兴', '星', '猩', '惺', '腥', '应', '英', '莺', '婴', '瑛', '嘤', '缨', '撄', '罂', '樱', '鹦', '膺'];  
ing2 = ['伶', '灵', '玲', '囹', '苓', '泠', '瓴', '铃', '陵', '菱', '凌', '聆', '翎', '绫', '羚', '棱', '龄', '零', '鲮', '名', '明', '鸣', '茗', '冥', '铭', '溟', '暝', '瞑', '宁', '狞', '咛', '拧', '柠', '甯', '平', '苹', '凭', '坪', '屏', '瓶', '萍', '情', '氰', '晴', '擎', '黥', '廷', '庭', '亭', '停', '婷', '蜓', '霆', '刑', '邢', '行', '陉', '形', '荥', '型', '迎', '茔', '荥', '荧', '盈', '莹', '萤', '营', '萦', '滢', '楹', '颖', '蝇', '赢', '瀛'];  
ing3 = ['丙', '陃', '邴', '秉', '昺', '炳', '柄', '饼', '禀', '鞞', '顶', '鼎', '井', '阱', '刭', '景', '岭', '领', '酩', '拧', '请', '挺', '铤', '艇', '省', '醒', '擤', '郢', '颍', '影'];  
ing4 = ['并', '並', '病', '竝', '摒', '订', '饤', '忊', '钉', '矴', '定', '铤', '萣', '啶', '腚', '锭', '劲', '迳', '静', '径', '胫', '净', '竞', '敬', '靖', '境', '镜', '另', '令', '呤', '命', '宁', '佞', '泞', '倿', '庆', '磬', '罄', '兴', '杏', '性', '幸', '姓', '荇', '悻', '应', '映', '硬', '媵'];  
  
ong1 = ['冲', '充', '忡', '沖', '茺', '珫', '翀', '舂', '嘃', '憧', '艟', '蹖', '匆', '苁', '囟', '忩', '枞', '葱', '骢', '聪', '东', '冬', '咚', '岽', '昸', '氡', '鸫', '笗', '工', '弓', '公', '厷', '功', '杛', '攻', '供', '侊', '肱', '宫', '恭', '蚣', '躬', '龚', '匑', '觥', '髸', '觵', '吽', '呍', '灴', '轰', '哄', '訇', '烘', '焢', '硡', '揈', '薨', '扃', '空', '倥', '崆', '箜', '松', '忪', '淞', '嵩', '恫', '通', '凶', '兄', '匈', '芎', '汹', '胸', '拥', '佣', '邕', '痈', '庸', '墉', '慵', '壅', '臃', '鳙', '中', '忠', '终', '钟', '盅', '衷', '螽', '宗', '枞', '综', '棕', '踪', '鬃'];  
ong2 = ['虫', '重', '隀', '崇', '崈', '漴', '褈', '蟲', '爞', '从', '丛', '淙', '悰', '孮', '琮', '仜', '弘', '妅', '屸', '红', '纮', '闳', '宏', '苰', '泓', '玜', '沗', '虹', '洪', '娂', '荭', '羾', '翃', '耾', '竑', '鸿', '霟', '龙', '珑', '胧', '聋', '笼', '隆', '窿', '农', '侬', '浓', '哝', '脓', '邛', '穷', '穹', '茕', '琼', '戎', '茸', '荣', '绒', '容', '溶', '榕', '熔', '仝', '同', '彤', '佟', '侗', '峒', '桐', '砼', '铜', '童', '酮', '瞳', '雄', '熊'];  
ong3 = ['宠', '埫', '董', '懂', '箽', '廾', '巩', '汞', '拱', '栱', '珙', '鞏', '哄', '冏', '炅', '炯', '窘',  '孔', '恐', '陇', '拢', '垄', '冗', '怂', '悚', '耸', '竦', '侗', '统', '桶', '捅', '筒', '永', '甬', '咏', '泳', '勇', '俑', '涌', '恿', '蛹', '踊', '肿', '种', '冢', '总', '偬'];  
ong4 = ['铳', '冲', '揰', '衝', '惚', '憁', '动', '冻', '侗', '垌', '恫', '栋', '胨', '迵', '峒', '洞', '胴', '戙', '共', '贡', '供', '唝', '讧', '澒', '蕻', '撔', '控', '弄', '讼', '宋', '诵', '送', '颂', '恸', '痛', '用', '佣', '众', '仲', '种', '重', '纵', '粽'];  
  
  
#韵脚  
class YunJiao(object):  
    def __init__(self):  
        self.dict = dict();  
  
    def genTable(self):  
        table = [['a1', a1], ['a2', a2], ['a3', a3], ['a4', a4], ['o1', o1], ['o2', o2], ['o3', o3], ['o4', o4], ['e1', e1], ['e2', e2], ['e3', e3], ['e4', e4], ['i1', i1], ['i2', i2], ['i3', i3], ['i4', i4], ['u1', u1], ['u2', u2], ['u3', u3], ['u4', u4], ['v1', v1], ['v2', v2], ['v3', v3], ['v4', v4], ['ai1', ai1], ['ai2', ai2], ['ai3', ai3], ['ai4', ai4], ['ei1', ei1], ['ei2', ei2], ['ei3', ei3], ['ei4', ei4], ['ui1', ui1], ['ui2', ui2], ['ui3', ui3], ['ui4', ui4], ['ao1', ao1], ['ao2', ao2], ['ao3', ao3], ['ao4', ao4], ['ou1', ou1], ['ou2', ou2], ['ou3', ou3], ['ou4', ou4], ['iu1', iu1], ['iu2', iu2], ['iu3', iu3], ['iu4', iu4], ['ie1', ie1], ['ie2', ie2], ['ie3', ie3], ['ie4', ie4], ['ve1', ve1], ['ve2', ve2], ['ve3', ve3], ['ve4', ve4], ['er1', er1], ['er2', er2], ['er3', er3], ['er4', er4], ['an1', an1], ['an2', an2], ['an3', an3], ['an4', an4], ['en1', en1], ['en2', en2], ['en3', en3], ['en4', en4], ['in1', in1], ['in2', in2], ['in3', in3], ['in4', in4], ['un1', un1], ['un2', un2], ['un3', un3], ['un4', un4], ['vn1', vn1], ['vn2', vn2], ['vn3', vn3], ['vn4', vn4], ['ang1', ang1], ['ang2', ang2], ['ang3', ang3], ['ang4', ang4], ['eng1', eng1], ['eng2', eng2], ['eng3', eng3], ['eng4', eng4], ['ing1', ing1], ['ing2', ing2], ['ing3', ing3], ['ing4', ing4], ['ong1', ong1], ['ong2', ong2], ['ong3', ong3], ['ong4', ong4]];  
  
  
        for i in range(len(table)):  
            self.dict[table[i][0]] = table[i][1];                        
  
    def keys(self):  
        return sorted(list(self.dict.keys()));  
  
    def find(self, key):  
        table = ['a', 'o', 'e', 'i', 'u', 'v', 'ai', 'ei', 'ui', 'ao', 'ou', 'iu', 'ie','ve', 'er', 'an', 'en', 'in', 'un', 'vn', 'ang', 'eng', 'ing', 'ong'];  
  
        if (key in table) or (key[:-1] in table):  
            print('--{0}--'.format(key));  
            a = self.dict[key]  
            print('该韵脚共收录汉字{0}个'.format(len(a)));  
            print(a);  
        else:  
            print('韵脚表：');  
            print(table); 

'''
def printYunJiao():  
    a = ['a', 'o', 'e', 'i', 'u', 'v', 'ai', 'ei', 'ui', 'ao', 'ou', 'iu', 'ie','ve', 'er', 'an', 'en', 'in', 'un', 'vn', 'ang', 'eng', 'ing', 'ong'];  
  
    b = ['1', '2', '3', '4'];  
      
    s = '[';  
    for i in range(len(a)):  
        for j in range(4):  
            s1 = a[i] + b[j];  
            s += '[\''+s1+'\''+', '+ s1 + '], ';  
  
    s += ']';  
  
    print(s);  
  
def stat():  
    yj = YunJiao();  
    yj.genTable();  
  
    k = yj.keys();  
  
    a = [];  
  
    for i in range(len(k)):  
        v = yj.dict[k[i]];  
        a.append([k[i], len(v), v]);  
  
    a = sorted(a, key = lambda v : (v[1], v[0]));  
  
    total = 0;  
    for i in range(len(a)):  
        print('韵脚{0}共收录汉字{1}个'.format(a[i][0], a[i][1]));  
        total += a[i][1];  
  
    print('此次共收录汉字{0}个'.format(total));  
  
  
#查找某一韵脚相关的汉字  
def findYunjiao(key):  
    yj = YunJiao();  
    yj.genTable();  
    yj.find(key); 

if __name__ == '__main__':  
	findYunjiao('ong4')        

	'''      