<?php 

/**
 * 阿里巴巴2014校招笔试题_时长问题
一、题目

一块不均匀的主板，从头烧到尾要2个小时，最少需要几块相同款型的主板，才能准确的衡量出2小时30分钟？

A.2根
B.3根
C.4根
D.5根

二、分析

首先，一看到题目就觉得很奇怪，一脸懵逼。题目中的“不均匀”的“主板”给我带来了很大的困惑，主板，作为计算机的学生，第一时间脑里呈现的就是电脑主板，可是题目的是指普通的木板吧，不均匀是不是代表着从头尾同时点燃，到烧完的时候，不是一个小时呢？

不过先不考虑不均匀这个问题吧？先来看下个人的解题，

用3根
1.两根一起点燃，第一根点一头，第二根点两头（头尾同时点燃）。
2.当第二根燃尽的时候（1h），立刻点燃第一根的另一头
3.当第一根燃尽（1.5h），立刻点燃第三根两头
4.第三根燃尽即为（2.5h）

用2根
1.用两个主板平放在一起，同时点燃，一根点燃左端，一根点燃右端，当两根相遇的时候就是1h
2.相遇的时候立刻熄灭了一根，等另一根烧完，这样又过了一个小时，加起来就是2h了
3.最后把熄灭的那根两端同时点燃，燃烧完毕，就用了半个小时，总共2.5h

具体答案是怎样的我也不清楚，总感觉很懵逼，总的来说，还是买个手表好啊！！
 */