var jsonData = [{
    "question": "四书五经里没有的是？",
    "subject": [{
        "A": "《大学》",
        "B": "《易》",
        "C": "《诗经》"
    }],
    "answer": ""
}, {
    "question": "我国第一部诗歌总集是?",
    "subject": [{
        "A": "《诗经》",
        "B": "《史记》",
        "C": "《新书》"
    }],
    "answer": ""
}, {
    "question": "《诗经》全书共有?",
    "subject": [{
        "A": "108篇 ",
        "B": "305篇 ",
        "C": "233篇"
    }],
    "answer": ""
}, {
    "question": "《诗经》最基本的句式是?",
    "subject": [{
        "A": "四言 ",
        "B": "七律 ",
        "C": "五绝"
    }],
    "answer": ""
}, {
    "question": "《论语》是一部?",
    "subject": [{
        "A": "纪传体著作",
        "B": "语录体著作 ",
        "C": "编年体著作"
    }],
    "answer": ""
}, {
    "question": "《劝学》的作者是?",
    "subject": [{
        "A": "老子",
        "B": "荀子 ",
        "C": "孔子"
    }],
    "answer": ""
}, {
    "question": "“醉里挑灯看剑，梦回吹角连营。”是辛弃疾的哪首词？",
    "subject": [{
        "A": "《破阵子》",
        "B": "《南乡子》",
        "C": "《菩萨蛮》"
    }],
    "answer": ""
}, {
    "question": "目的在于“究天人之际，通古今之变，成一家之言”的著作是?",
    "subject": [{
        "A": "《史记》",
        "B": "《资治通鉴》",
        "C": "《左传》"
    }],
    "answer": ""
}, {
    "question": "贾谊的文集是?",
    "subject": [{
        "A": "《过秦论》",
        "B": "《新书》",
        "C": "《咏史》"
    }],
    "answer": ""
}, {
    "question": "《过秦论》的作者是?",
    "subject": [{
        "A": "贾谊",
        "B": "刘邦",
        "C": "钟嵘"
    }],
    "answer": ""
}, {
    "question": "《论衡》的作者是?",
    "subject": [{
        "A": "王维",
        "B": "王充",
        "C": "王勃"
    }],
    "answer": ""
}, {
    "question": "《孔雀东南飞》是中国文学史上第一部？",
    "subject": [{
        "A": "长篇叙事诗",
        "B": "长篇纪传诗",
        "C": "笔记小说集"
    }],
    "answer": ""
}, {
    "question": "在中国文学史上，首先开创以乐府古题作诗的诗人是?",
    "subject": [{
        "A": "曹植",
        "B": "曹操",
        "C": "曹冲"
    }],
    "answer": ""
}, {
    "question": "在“建安”时代，文学成就最高，有“建安之杰”之誉的诗人是?",
    "subject": [{
        "A": "曹植",
        "B": "曹操",
        "C": "曹冲"
    }],
    "answer": ""
}, {
    "question": "我国诗歌史上，第一首较为完整的七言诗是谁的哪个作品?",
    "subject": [{
        "A": "曹丕《燕歌行》",
        "B": "曹丕《沧海赋》",
        "C": "曹丕《济川赋》"
    }],
    "answer": ""
}, {
    "question": "《登楼赋》的作者是?",
    "subject": [{
        "A": "王粲",
        "B": "王安石",
        "C": "孟浩然"
    }],
    "answer": ""
}, {
    "question": "阮籍的诗歌代表作是?",
    "subject": [{
        "A": "《咏怀》",
        "B": "《咏史》",
        "C": "《洛神赋》"
    }],
    "answer": ""
}, {
    "question": "《三都赋》的作者是?",
    "subject": [{
        "A": "刘禹锡",
        "B": "左思",
        "C": "柳宗元"
    }],
    "answer": ""
}, {
    "question": "东晋玄言诗的代表作家是?",
    "subject": [{
        "A": "谢晋",
        "B": "孙绰",
        "C": "谢安"
    }],
    "answer": ""
}, {
    "question": "《归去来兮辞》作者是？",
    "subject": [{
        "A": "陶渊明",
        "B": "许询",
        "C": "郭璞"
    }],
    "answer": ""
}, {
    "question": "《哀江南赋》的作者是?",
    "subject": [{
        "A": "庾信",
        "B": "李商隐",
        "C": "白居易"
    }],
    "answer": ""
}, {
    "question": "南朝乐府民歌艺术水平最高的长诗为?",
    "subject": [{
        "A": "《长歌行》",
        "B": "《西洲曲》",
        "C": "《苏小小歌》"
    }],
    "answer": ""
}, {
    "question": "北朝乐府民歌艺术水平最高的长诗为?",
    "subject": [{
        "A": "东飞伯劳歌",
        "B": "《木兰诗》",
        "C": "《琅琊王歌辞》"
    }],
    "answer": ""
}, {
    "question": "《世说新语》的作者是?",
    "subject": [{
        "A": "刘峻",
        "B": "刘义庆",
        "C": "敬胤"
    }],
    "answer": ""
}, {
    "question": "提出，文章“乃经国之大业，不朽之盛事”的人是?",
    "subject": [{
        "A": "曹操",
        "B": "曹植",
        "C": "曹丕"
    }],
    "answer": ""
}, {
    "question": "《文心雕龙》的作者是?",
    "subject": [{
        "A": "谢灵运",
        "B": "柳恽",
        "C": "刘勰"
    }],
    "answer": ""
}, {
    "question": "王勃的名句“海内存知己，天涯若比邻”所属诗篇是?",
    "subject": [{
        "A": "《黄鹤楼送孟浩然之广陵》",
        "B": "《送杜少府之任蜀州》",
        "C": "《白雪歌送武判官归京》"
    }],
    "answer": ""
}, {
    "question": "长篇歌行《春江花月夜》的作者是?",
    "subject": [{
        "A": "张若虚",
        "B": "岑参",
        "C": "王羲之"
    }],
    "answer": ""
}, {
    "question": "被称为由盛唐到中唐过渡的集大成诗人是?",
    "subject": [{
        "A": "杜甫",
        "B": "李白",
        "C": "孟浩然"
    }],
    "answer": ""
}, {
    "question": "《逢雪宿芙蓉山主人》的作者是?",
    "subject": [{
        "A": "白居易",
        "B": "王昌龄",
        "C": "刘长卿"
    }],
    "answer": ""
}, {
    "question": "提出“文章合为时而著，歌诗合为事而作”的诗人是?",
    "subject": [{
        "A": "卢照邻",
        "B": "白居易",
        "C": "杜甫"
    }],
    "answer": ""
}, {
    "question": "著名诗歌《西塞山怀古》的作者是?",
    "subject": [{
        "A": "杜牧",
        "B": "温庭筠",
        "C": "刘禹锡"
    }],
    "answer": ""
}, {
    "question": "著名诗句“沉舟侧畔千帆过，病树前头万木春”所属诗篇是?",
    "subject": [{
        "A": "《酬乐天扬州初逢席上见赠》",
        "B": "《南陵别儿童入京》",
        "C": "《渭城曲/送元二使安西》"
    }],
    "answer": ""
}, {
    "question": "苦吟诗“二句三年得，一吟双泪流。知音如不赏，归卧故山秋”的作者是?",
    "subject": [{
        "A": "王之涣",
        "B": "韩愈",
        "C": "贾岛"
    }],
    "answer": ""
}, {
    "question": "“永州八记”的作者是?",
    "subject": [{
        "A": "贾谊",
        "B": "柳宗元",
        "C": "郑板桥"
    }],
    "answer": ""
}, {
    "question": "自创“无题”诗的诗人是?",
    "subject": [{
        "A": "刘禹锡",
        "B": "王安石",
        "C": "李商隐"
    }],
    "answer": ""
}, {
    "question": "我国最早的一部文人词总集是?",
    "subject": [{
        "A": "《阳春集》",
        "B": "《尊前集》",
        "C": "《花间集》"
    }],
    "answer": ""
}, {
    "question": "花间派的鼻祖是?",
    "subject": [{
        "A": "柳宗元",
        "B": "王昌龄",
        "C": "温庭筠"
    }],
    "answer": ""
}, {
    "question": "陆游的诗集是?",
    "subject": [{
        "A": "《金奁集》",
        "B": "《饮水词》",
        "C": "《剑南诗稿》"
    }],
    "answer": ""
}, {
    "question": "有“古今律诗第一”之誉的宋代诗人是?",
    "subject": [{
        "A": "周敦颐",
        "B": "陆游",
        "C": "韩愈"
    }],
    "answer": ""
}, {
    "question": "古人说的“拙荆”是对自己什么人的称呼？",
    "subject": [{
        "A": "弟弟",
        "B": "妹妹",
        "C": "老婆"
    }],
    "answer": ""
}, {
    "question": "欲把西湖比西子，淡妆浓抹总相宜。这里西子是指？",
    "subject": [{
        "A": "西门子",
        "B": "西施",
        "C": "西门庆"
    }],
    "answer": ""
}, {
    "question": "一般认为，北宋风俗画，《清明上河图》描绘的是什么季节的景象?",
    "subject": [{
        "A": "春天",
        "B": "夏天",
        "C": "秋天"
    }],
    "answer": ""
}, {
    "question": "四大书院中位于江西的是?",
    "subject": [{
        "A": "翰林书院",
        "B": "白鹿书院",
        "C": "嵩阳书院"
    }],
    "answer": ""
}, {
    "question": "玄奘去西天取经经过了多少个国家?",
    "subject": [{
        "A": "666 ",
        "B": "233 ",
        "C": "110"
    }],
    "answer": ""
}, {
    "question": "道家学派开创者是?",
    "subject": [{
        "A": "老子",
        "B": "孟子",
        "C": "墨子"
    }],
    "answer": ""
}, {
    "question": "《左传》全称?",
    "subject": [{
        "A": "《春秋左氏传》",
        "B": "《战国左氏传》",
        "C": "《左边向右传》"
    }],
    "answer": ""
}, {
    "question": "我国第一部国别体史书是?",
    "subject": [{
        "A": "《左传》",
        "B": "《史记》",
        "C": "《国语》"
    }],
    "answer": ""
}, {
    "question": "《汉书》的作者是?",
    "subject": [{
        "A": "刘邦",
        "B": "司马迁",
        "C": "班固"
    }],
    "answer": ""
}, {
    "question": "《论积贮疏》的作者是?",
    "subject": [{
        "A": "贾玲",
        "B": "贾谊",
        "C": "贾岛"
    }],
    "answer": ""
}, {
    "question": "《洛神赋》的作者是?",
    "subject": [{
        "A": "曹丕",
        "B": "曹植",
        "C": "曹冲"
    }],
    "answer": ""
}, {
    "question": "《咏史》八首的作者是?",
    "subject": [{
        "A": "司马光",
        "B": "左思",
        "C": "右想"
    }],
    "answer": ""
}, {
    "question": "《归去来兮辞》的作者是?",
    "subject": [{
        "A": "李商隐",
        "B": "范仲淹",
        "C": "陶渊明"
    }],
    "answer": ""
}, {
    "question": "《长安古意》的作者是?",
    "subject": [{
        "A": "卢照邻",
        "B": "宋祁",
        "C": "黄庭坚"
    }],
    "answer": ""
}, {
    "question": "著名诗句“气蒸云梦泽，波撼岳阳城”是非同凡响的盛唐之音。其作者是?",
    "subject": [{
        "A": "梅尧臣",
        "B": "苏辙",
        "C": "孟浩然"
    }],
    "answer": ""
}, {
    "question": "北宋诗文革新运动的领袖是?",
    "subject": [{
        "A": "晏殊",
        "B": "欧阳修",
        "C": "苏轼"
    }],
    "answer": ""
}, {
    "question": "易安居士是?",
    "subject": [{
        "A": "温庭筠",
        "B": "李清照",
        "C": "李治"
    }],
    "answer": ""
}, {
    "question": "晚年自号“六一居士”的作家是?",
    "subject": [{
        "A": "范成大",
        "B": "苏洵",
        "C": "欧阳修"
    }],
    "answer": ""
}, {
    "question": "陆游的号是?",
    "subject": [{
        "A": "范仲淹",
        "B": "放翁",
        "C": "杨万里"
    }],
    "answer": ""
}, {
    "question": "在南宋词坛上与辛弃疾、吴文英鼎足而三的作家是?",
    "subject": [{
        "A": "郑燮",
        "B": "姜夔",
        "C": "刘禹锡"
    }],
    "answer": ""
}, {
    "question": "《指南录》的作者是?",
    "subject": [{
        "A": "文天祥",
        "B": "王维",
        "C": "李商隐"
    }],
    "answer": ""
}, {
    "question": "《柳毅传书》的作者是?",
    "subject": [{
        "A": "贾谊 ",
        "B": "尚仲贤.",
        "C": "卢照邻"
    }],
    "answer": ""
}, {
    "question": "《西厢记》共有多少本多少折?",
    "subject": [{
        "A": "六本六十六折",
        "B": "两本三十三折",
        "C": "五本二十折"
    }],
    "answer": ""
}, {
    "question": "《从军行七首》的作者是?",
    "subject": [{
        "A": "王安石",
        "B": "王昌龄",
        "C": "王羲之"
    }],
    "answer": ""
}, {
    "question": "“郁郁涧底松，离离山上苗。”出自于？",
    "subject": [{
        "A": "《诗经·采薇》",
        "B": "左思《咏史》",
        "C": "左思《三都赋》"
    }],
    "answer": ""
}, {
    "question": "《陌上桑》的女主人公是?",
    "subject": [{
        "A": "罗敷",
        "B": "紫薇",
        "C": "依萍"
    }],
    "answer": ""
}, {
    "question": "《七发》的作者是?",
    "subject": [{
        "A": "沈括",
        "B": "温庭筠",
        "C": "枚乘"
    }],
    "answer": ""
}, {
    "question": "被钟嵘评为“骨气奇高，词彩华茂”的建安诗人是?",
    "subject": [{
        "A": "曹丕",
        "B": "曹植",
        "C": "曹冲"
    }],
    "answer": ""
}, {
    "question": "我国古代第一个把圆周率推算到小数点后七位的数学家是？",
    "subject": [{
        "A": "杨辉",
        "B": "祖冲之",
        "C": "张邱建"
    }],
    "answer": ""
}, {
    "question": "中国古代把直角三角形的两条直角边和斜边分别称为？",
    "subject": [{
        "A": "勾股弦",
        "B": "边角边",
        "C": "角边角"
    }],
    "answer": ""
}, {
    "question": "算盘起源于哪个国家？",
    "subject": [{
        "A": "中国",
        "B": "韩国",
        "C": "日本"
    }],
    "answer": ""
}, {
    "question": "算盘上栏一般为几珠？",
    "subject": [{
        "A": "四珠",
        "B": "三珠",
        "C": "两珠"
    }],
    "answer": ""
}, {
    "question": "著名的“杨辉三角”又被称作？",
    "subject": [{
        "A": "等腰三角",
        "B": "贾宪三角",
        "C": "百慕大三角"
    }],
    "answer": ""
}, {
    "question": "古代礼仪中，大堂上什么位置为尊？",
    "subject": [{
        "A": "靠西面东",
        "B": "自西向东",
        "C": "坐北朝南"
    }],
    "answer": ""
}, {
    "question": "古代礼仪中，内室里什么位置为尊？",
    "subject": [{
        "A": "靠西面东",
        "B": "自西向东",
        "C": "坐北朝南"
    }],
    "answer": ""
}, {
    "question": "古诗名句“身无彩凤双飞翼”的下一句是？",
    "subject": [{
        "A": "夜吟应觉月光寒",
        "B": "心有灵犀一点通",
        "C": "东风无力百花残"
    }],
    "answer": ""
}, {
    "question": "古诗名句：“渚云低暗度”的下句是？",
    "subject": [{
        "A": "关月冷相随",
        "B": "寒塘欲下迟",
        "C": "寒塘欲下迟"
    }],
    "answer": ""
}, {
    "question": "古诗名句：“梅落繁枝千万片，犹自多情，学雪随风转。的作者是？",
    "subject": [{
        "A": "陶渊明",
        "B": "杜甫",
        "C": "冯延巳"
    }],
    "answer": ""
}, {
    "question": "宋词名句“天涯地角有穷时”的下一句是？",
    "subject": [{
        "A": "只有相思无尽处",
        "B": "直挂云帆济沧海",
        "C": "拔剑四顾心茫然"
    }],
    "answer": ""
}, {
    "question": "古诗名句“挥手自兹去”的下句是？",
    "subject": [{
        "A": "孤蓬万里征",
        "B": "落日故人情",
        "C": "萧萧班马鸣"
    }],
    "answer": ""
}, {
    "question": "古诗名句“举杯邀明月”的下句是？",
    "subject": [{
        "A": "低头思故乡",
        "B": "对影成三人",
        "C": "千里共婵娟"
    }],
    "answer": ""
}, {
    "question": "古诗名句“松下问童子”的下句是？",
    "subject": [{
        "A": "云深不知处",
        "B": "言师采药去",
        "C": "久被愁苦关"
    }],
    "answer": ""
}, {
    "question": "中国十位名画家各有其长，擅长画马的是？",
    "subject": [{
        "A": "石鲁",
        "B": "徐悲鸿",
        "C": "齐白石"
    }],
    "answer": ""
}, {
    "question": "《梦溪笔谈》是宋代记载古代科技的著作，其作者是？",
    "subject": [{
        "A": "王维",
        "B": "沈括",
        "C": "孟浩然"
    }],
    "answer": ""
}, {
    "question": "盆景艺术是中国历史悠久的一种园林艺术，盆景艺术五大流派包括苏派、扬派、徽派、川派和？",
    "subject": [{
        "A": "印象画派",
        "B": "岭南派",
        "C": "海上画派"
    }],
    "answer": ""
}, {
    "question": "清代官服上绣有方形图案，称为“补子”，其中二品武官的补子图案是？",
    "subject": [{
        "A": "孔雀",
        "B": "狮子",
        "C": "老虎"
    }],
    "answer": ""
}, {
    "question": "清代官服上绣有方形图案，称为“补子”，其中三品文官的补子图案是？",
    "subject": [{
        "A": "孔雀",
        "B": "麒麟",
        "C": "貔貅"
    }],
    "answer": ""
}, {
    "question": "“宁可枝头抱香死”的作者是谁？",
    "subject": [{
        "A": "文天祥",
        "B": "郑思肖",
        "C": "尚仲贤"
    }],
    "answer": ""
}, {
    "question": "《嘎达梅林》是哪个民族的民歌？",
    "subject": [{
        "A": "蒙古族",
        "B": "维吾尔族",
        "C": "哈萨克族"
    }],
    "answer": ""
}, {
    "question": "中国戏曲中的人物角色可分为生、旦、净、末、丑，哪一个是女角色的统称？",
    "subject": [{
        "A": "旦",
        "B": "净",
        "C": "末"
    }],
    "answer": ""
}, {
    "question": "元始天尊是道教“三清”中的哪一位？",
    "subject": [{
        "A": "玉清",
        "B": "上清",
        "C": "太清"
    }],
    "answer": ""
}, {
    "question": "“峨眉山”是中国佛教四大名山之一，它位于哪个省？",
    "subject": [{
        "A": "湖南",
        "B": "四川",
        "C": "湖北"
    }],
    "answer": ""
}, {
    "question": "战国时期，与“负荆请罪”这一典故关联的人物是？",
    "subject": [{
        "A": "荆轲与秦王 ",
        "B": "米老鼠与唐老鸭 ",
        "C": "廉颇与蔺相如"
    }],
    "answer": ""
}, {
    "question": "中国神话传说中开天辟地的是？",
    "subject": [{
        "A": "葫芦娃",
        "B": "女娲",
        "C": "盘古"
    }],
    "answer": ""
}, {
    "question": "战国时期与儒家并称为显学的是？",
    "subject": [{
        "A": "墨家",
        "B": "儒家",
        "C": "道家"
    }],
    "answer": ""
}, {
    "question": "“贬天子，退诸侯，讨大夫，以达王事而已矣”，这句话出自《史记》的？",
    "subject": [{
        "A": "《陌上桑》",
        "B": "《太史公自序》",
        "C": "《梦溪笔谈》"
    }],
    "answer": ""
}, {
    "question": "“文变染乎世情，兴废系乎时序”，出自？",
    "subject": [{
        "A": "《文心雕龙》",
        "B": "《史记》",
        "C": "《蜀道难》"
    }],
    "answer": ""
}, {
    "question": "《唐风集》的作者是？",
    "subject": [{
        "A": "唐青枫",
        "B": "曲无忆",
        "C": "杜荀鹤"
    }],
    "answer": ""
}, {
    "question": "被称作“诗囚”的诗人是？",
    "subject": [{
        "A": "孙膑",
        "B": "孟郊",
        "C": "司马懿"
    }],
    "answer": ""
}, {
    "question": "张若虚有“孤篇压倒全唐”美誉的作品是？",
    "subject": [{
        "A": "《春江花月夜》",
        "B": "《花好月圆夜》",
        "C": "《明月几时有》"
    }],
    "answer": ""
}];
